/////// COMMON
IDC_DGN_DESIGN_CODE                           = "Design Code"
IDC_DGN_NATL_ANNEX                            = "National Annex"
IDC_DGN_SECTION_LIST                          = "Section List"
IDC_DGN_GENERAL                               = "General"
IDC_DGN_DESIGN                                = "Design"
IDC_DGN_DRAWING                               = "Drawing"
IDC_DGN_WORD                                  = "Word"
IDC_DGN_SYSTEM                                = "System"
IDC_DGN_LAYER                                 = "Layer"
IDC_DGN_LAYOUT                                = "Layout"
IDC_DGN_FILE                                  = "File"
IDC_DGN_DWG                                   = "DWG"
IDC_DGN_DESIGN_FORCE                          = "Design Force"
IDC_DGN_MEMBER_NAME                           = "Member Name"
IDC_DGN_BAR_SPACE_MOMENT                      = "Moment"
IDC_DGN_BAR_SPACE_SHEAR                       = "Shear"
IDC_DGN_SECTION                               = "Section"
IDC_DGN_WAVE_DASH                             = "~"
IDC_DGN_BUTTON_DESIGN                         = "Design"
IDC_DGN_BUTTON_OK                             = "&OK"
IDC_DGN_BUTTON_APPLY                          = "&Apply"
IDC_DGN_BUTTON_CLOSE                          = "&Close"
IDC_DGN_BUTTON_CANCEL                         = "&Cancel"
IDC_DGN_BUTTON_DEFAULT                        = "&Default"
IDC_DGN_BUTTON_ADD                            = "&Add"
IDC_DGN_BUTTON_DELETE                         = "&Delete"
IDC_DGN_BUTTON_INSERT                         = "&Insert"

IDC_DGN_TAB_SECTION                           = "Section"
IDC_DGN_TAB_REBAR                             = "Rebar"
IDC_DGN_TAB_FORCE                             = "Force"
IDC_DGN_TAB_DESIGN                            = "Design"
IDC_DGN_TAB_LOAD_INFO                         = "Load"
IDC_DGN_TAB_MATERIAL_INFO                     = "Material"
IDC_DGN_TAB_SECTION_INFO                      = "Section"
IDC_DGN_TAB_SECTION_INFO_1                    = "Section-1"
IDC_DGN_TAB_SECTION_INFO_2                    = "Section-2"
IDC_DGN_TAB_SECTION_INFO_3                    = "Section-3"
IDC_DGN_TAB_SECTION_INFO_4                    = "Section-4"
IDC_DGN_TAB_REBAR_INFO                        = "Rebar"
IDC_DGN_TAB_FORCE_INFO                        = "Force"
IDC_DGN_TAB_DESIGN_INFO                       = "Design"
IDC_DGN_TAB_OPTION_INFO                       = "Option"
IDC_DGN_TAB_FOOTING_INFO                      = "Footing"
IDC_DGN_TAB_REINFOCE                          = "Reinforce"
IDC_DGN_TAB_REINFOCE_MATERIAL                 = "Material"
IDC_DGN_TAB_REINFOCE_POSITION                 = "Position"
IDC_DGN_TAB_BASE_PLATE                        = "Base Plate"
IDC_DGN_TAB_RIB_PLATE                         = "Rib Plate"
IDC_DGN_TAB_ANCHOR_BOLT                       = "Anchor Bolt"
IDC_DGN_TAB_WELDING                           = "Welding"
IDC_DGN_TAB_PLATE                             = "Plate"
IDC_DGN_TAB_RIB                               = "Rib"
IDC_DGN_TAB_BOLT                              = "Bolt"

IDC_DGN_SYNC_WITH_INFO_TABLE                  = "Sync with Info. Table"
IDC_DGN_SELECTED_ONLY                         = "Selected Only"

////// IDD_DGN_LINK_DLG
IDD_DGN_LINK_DLG                              = "Link"
IDC_LINK_BTN                                  = "Connect"
IDC_DELINK_BTN                                = "Disconnect"
IDC_LINK_TEXT                                 = "Link with :"

///// IDD_DGN_UPLINK_SELECT_DLG
IDD_DGN_UPLINK_SELECT_DLG                     = "Select Link Data"
IDS_DGN_UPLINK_NOT_SELECT_STORY               = "Story is NOT Selected."
IDS_DGN_UPLINK_NOT_SELECT_GROUP               = "Group is NOT Selected."
IDS_DGN_UPLINK_NOT_SELECT_WALL_MARK           = "Wall Mark is NOT Selected."
IDS_DGN_UPLINK_FAIL_SAVE_FILE                 = "Saving Export Data to File is Failed."
IDS_DGN_UPLINK_SUPPORT_BY_OPTION              = "The export function cannot be used.\nIt can only be used if you have the appropriate option."
IDS_DGN_UPLINK_SELECT_MEMB                    = "Select Member to Export"
IDS_DGN_UPLINK_SETTING                        = "UP Link Setting"
IDS_DGN_UPLINK_SECT_NOT_APPLIED               = "Section setting is not applied."
IDS_DGN_UPLINK_SECT_ANA_APPLIED               = "Section for Analysis setting is applied."
IDS_DGN_UPLINK_SECT_DGN_APPLIED               = "Section for Design setting is applied."
IDS_DGN_UPLINK_THCK_NOT_APPLIED               = "Thickness setting is not applied."
IDS_DGN_UPLINK_THCK_ANA_APPLIED               = "Thickness for Analysis setting is applied."
IDS_DGN_UPLINK_THCK_DGN_APPLIED               = "Thickness for Design setting is applied."
IDS_DGN_UPLINK_MATL_NOT_APPLIED               = "Material setting is not applied."
IDS_DGN_UPLINK_MATL_ANA_APPLIED               = "Material for Analysis setting is applied."
IDS_DGN_UPLINK_MATL_DGN_APPLIED               = "Material for Design setting is applied."

///// IDD_DGN_PREF_DESIGN_SECTION_DLG
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_SECTION       = "Default"
IDC_DGN_PREF_DESIGN_FRAME_INCREASE_RCS        = "Section Increment (RC)"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_SLAB       = "Slab"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_BEAM_GIRDER = "Beam && Girder"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_COLUMN     = "Column"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_SHEAR_WALL = "Shear Wall"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_FOOTING    = "Footing"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GUCBF      = "Combined Footing"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_BASE_WALL  = "Base Wall"
IDC_DGN_PREF_DESIGN_STRING_INCREASE_GURST     = "Stair"
IDC_DGN_PREF_DESIGN_STRING_INCREASE_GURBU     = "Buttress"
IDC_DGN_PREF_DESIGN_STRING_INCREASE_GURCB     = "Corbel/Bracket"
IDC_DGN_PREF_DESIGN_FRAME_INCREASE_SRC        = "Section Increment (SRC)"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GUCCO      = "Column (Encased)"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GUCFT      = "CFT Column"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GURSF      = "Strip Footing"
IDC_DGN_PREF_DESIGN_FRAME_INCREASE_RFM        = "Section Increment (Reinforce)"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GUFSL      = "Slab"
IDC_DGN_PREF_DESIGN_LABEL_INCREASE_GUFBE      = "Beam"

/// IDD_DGN_PREF_DESIGN_SRC_DLG
IDC_DGN_PREF_DESIGN_CHECK_GUCCO_B             = "Max. Width"
IDC_DGN_PREF_DESIGN_CHECK_GUCCO_D             = "Max. Height"
IDC_DGN_PREF_DESIGN_CHECK_GUCCO_R             = "Max. Steel Ratio"
IDC_DGN_PREF_FRAME_COLUMN_ENCASED             = "Column (Encased)"
IDC_DGN_PREF_DESIGN_CHECK_GUCCO               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GUCFT_B             = "Max. Width"
IDC_DGN_PREF_DESIGN_CHECK_GUCFT_D             = "Max. Height"
IDC_DGN_PREF_DESIGN_CHECK_GUCFT_R             = "Max. Steel Ratio"
IDC_DGN_PREF_FRAME_CFT_COLUMN                 = "CFT Column"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_SRC           = "Default"
IDC_DGN_PREF_DESIGN_CHECK_GUCFT               = "Change Section by Design"

// IDD_DGN_PREF_DESIGN_STL_DLG
IDC_DGN_PREF_DESIGN_CHECK_FRAME_BASEPLATE     = "Base Plate"
IDC_DGN_PREF_DESIGN_CHECK_GUSBP               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GUSBP_B             = "Max. Width"
IDC_DGN_PREF_DESIGN_CHECK_GUSBP_D             = "Max. Height"
IDC_DGN_PREF_DESIGN_LABEL_GUSEP               = "Embedded Plate"
IDC_DGN_PREF_DESIGN_CHECK_GUSEP               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GUSEP_B             = "Max. Width"
IDC_DGN_PREF_DESIGN_CHECK_GUSEP_D             = "Max. Height"
IDC_DGN_PREF_DESIGN_LABEL_GUSWB               = "Corrugated Web Beam"
IDC_DGN_PREF_DESIGN_CHECK_GUSWB               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GUSWB_B             = "Change Width"
IDC_DGN_PREF_DESIGN_CHECK_GUSWB_D             = "Change Height"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_STL           = "Default"

/// IDD_DGN_PREF_DESIGN_WALL_DLG
IDC_DGN_PREF_DESIGN_FRAME_GURSW               = "Shear Wall"
IDC_DGN_PREF_DESIGN_CHECK_GURSW               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GURSW_D             = "Max. Thick"
IDC_DGN_PREF_DESIGN_CHECK_GURSW_GEN           = "Use Design Method of Gen/ADS"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_RC1           = "Default"
IDC_DGN_PREF_DESIGN_LABEL_GURSW_GEN           = "Design Method"
IDC_DGN_PREF_DESIGN_LABEL_GURSW_GEN2          = "No. of End Rebars"

////// IDD_DGN_PREF_DLG
IDD_DGN_PREF_DLG                              = "Preference"
IDC_DGN_PREF_BTN_DEFAULT_ALL                  = "Default (All)"
IDC_DGN_PREF_BTN_CLOSE                        = "Cancel"
IDC_DGN_PREF_BTN_OK                           = "OK"

IDD_DGN_DGNOPT_DLG                            = "Design Option"
IDD_DGN_DWGOPT_DLG                            = "Drawing Option"
IDS_DGN_MSG_RESET_OPTION_DATA                 = "Do you want to Reset all Options?"
IDC_DGN_PREF_DESIGN_LBL_BATCH_BEAM            = "※ ""Change Section by Design"" is not applied in Batch Beam"
IDC_DGN_PREF_DESIGN_LBL_BATCH_COLM            = "※ ""Change Section by Design"" is not applied in Batch Column"

///// IDD_DGN_PREF_DRAWING_DLG
IDC_DGN_PREF_BTN_DEFAULT_DRAWING              = "Default"

/// IDD_DGN_PREF_DRAWING_DWG_DLG
IDC_DGN_PREF_DRAWING_DWG_CHECK_TIEBAR         = "Create Tie Bar"
IDC_DGN_PREF_DRAWING_DWG_CHECK_BARNAME        = "Use Name by Strength"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RC_BEAM        = "RC Beam && Girder"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RC_COLUMN      = "RC Column"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RC_GENCOL      = "RC Column ( General Section )"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RC_FOOTING     = "RC Footing"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RC_COMB_FOOTING  = "RC Combined Footing"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RFM_BEAM       = "Reinforce Beam && Girder"
IDC_DGN_PREF_DRAWING_DWG_CHECK_RFM_COLM       = "Reinforce Column"
IDC_DGN_PREF_BTN_DEFAULT_DRAWING_DWG          = "Default"
IDC_DGN_PREF_DRAWING_DWG_FRAME_TIEBAR         = "Tie Bar of Column"
IDC_DGN_PREF_DRAWING_DWG_STRING_TIEBAR_TYPE   = "Type for Circular Column"
IDC_DGN_PREF_DRAWING_DWG_FRAME_REBAR_NAME     = "Rebar Name"
IDC_DGN_PREF_DRAWING_DWG_STRING_NAME_OVER     = "fy ≥"
IDC_DGN_PREF_DRAWING_DWG_STRING_NAME_UNDER    = "fy <"
IDC_DGN_PREF_DRAWING_DWG_FRAME_DESIGN_FORCE   = "Print Design Force"
IDC_DGN_PREF_DRAWING_DWG_FRAME_TYPE_OF_REBAR  = "Type of Rebar Table (Batch Wall)"
IDC_DGN_PREF_DRAWING_RADIO_BATCHWALL_COMPACT  = "Compact Type"
IDC_DGN_PREF_DRAWING_RADIO_BATCHWALL_SPREAD   = "Spread Type"
IDC_DGN_PREF_DRAWING_DWG_FRAME_NON_SCALED     = "Non-Scaled Drawing"
IDC_DGN_PREF_DRAWING_DWG_CHECK_NOSCALE_URBE   = "RC Beam && Girder"
IDC_DGN_PREF_DRAWING_DWG_CHECK_NOSCALE_URBU   = "RC Buttress"
IDC_DGN_PREF_DRAWING_DWG_CHECK_NOSCALE_URCO   = "RC Column"

IDS_DGN_DWG_BARNAME_NOT_EXIST                 = "Rebar Name Data is NOT Exist."
IDS_DGN_DWG_BARNAME_INVALID_DATA              = "Rebar Name Data has invalid Material or Empty Symbol."
IDS_DGN_DWG_BARNAME_DUPLICATE_DATA            = "Rebar Name Data has duplicated."
IDS_DGN_DWG_BARNAME_UNSORTED_DATA             = "Rebar Name Data is NOT Sorted."

//// IDD_DGN_PREF_DRAWING_FILE_DLG
IDC_DGN_PREF_DRAWING_FRAME_FILE               = "Frame File"
IDC_DGN_PREF_DRAWING_FRAME_LEGEND_FILE        = "Legend File"
IDC_DGN_PREF_BTN_DEFAULT_DRAWING_FILE         = "Default"
IDC_DGN_PREF_DRAWING_SYSTEM                   = "System"
IDC_DGN_PREF_DRAWING_SYSTEM2                  = "System"

//////// IDD_DGN_PREF_DRAWING_LAYER_DLG
IDC_DGN_DRAW_LAYER_FRAME_COMMON_ITEM          = "Common Item"
IDC_DGN_DRAW_LAYER_COMM_LIST                  = "List1"
IDC_DGN_DRAW_LAYER_FRAME_SYSTEM_ITEM          = "System Item"
IDC_DGN_DRAW_LAYER_SYST_LIST                  = "List1"
IDC_DGN_PREF_BTN_DEFAULT_DRAWING_LAYER        = "Default"
IDC_DGN_DRAW_LAYER_LABEL_SYSTEM               = "System"
IDC_DGN_DRAW_LAYER_LABEL_MEMBER               = "Member"

////// IDD_DGN_BAR_TABLE_DLG
IDD_DGN_BAR_TABLE_DLG                         = "Rebar Table"
IDC_BARTABLE_FRAME_CODE                       = "Code"
IDC_BARTABLE_FRAME_SPACE                      = "Spacing / Number"
IDC_BARTABLE_RADIO_BY_SPACE                   = "by Spacing"
IDC_BARTABLE_RADIO_BY_NUMBER                  = "by Number"
IDC_BARTABLE_BTN_ADD                          = "Add"
IDC_BARTABLE_BTN_ADD1                         = "Add"
IDC_BARTABLE_BTN_DEL                          = "Del"
IDC_BARTABLE_BTN_SORT                         = "Sort"
IDC_BARTABLE_FRAME_OPTION                     = "Option"
IDC_BARTABLE_CHECK_DOULBE                     = "Doubly Reinforced"
IDC_BARTABLE_BTN_DEFAULT                      = "Default"
IDC_BARTABLE_BTN_EXPORT                       = "Export"
IDC_BARTABLE_BTN_CALC                         = "Calculate"
IDC_QUANTITY_LABEL_STORY                      = "To"
IDC_BARTABLE_STATIC_CODE                      = "Code"
IDC_BARTABLE_STATIC_TYPE                      = "Type"
IDC_BARTABLE_STATIC_FROM                      = "From"
IDC_BARTABLE_STATIC_TO                        = "To"
IDC_BARTABLE_STATIC_STEP                      = "Step"
IDC_BARTABLE_STATIC_WAVE                      = "~"
IDC_QUANTITY_LABEL_COLNO                      = "Data per Column"

////// IDD_DGN_BAR_INFO_DLG
IDD_DGN_BAR_INFO_DLG                          = "Rebar Information"
IDC_BARINFO_LBL_CODE                          = "Rebar Code"
IDS_DGN_BARINFO_NAME                          = "Name"
IDS_DGN_BARINFO_DIAM                          = "Dia"
IDS_DGN_BARINFO_AREA                          = "Area"
IDS_DGN_BARINFO_DIAO                          = "Dia(Out)"
IDS_DGN_BARINFO_WGHT                          = "Weight"

////// IDD_DGN_SECT_INFO_DLG
IDD_DGN_SECT_INFO_DLG                         = "Steel Section Information"
IDC_SECTINFO_LBL_CODE                         = "Section Code"
IDC_SECTINFO_LBL_SHAP                         = "Section Shape"
IDC_SECTINFO_LBL_TYPE                         = "Section Type"
IDC_SECTINFO_LBL_PLCS                         = "Set Decimal Places"
IDC_SECTINFO_BTN_PLCS                         = "Set Decimal Places..."
IDC_SECTINFO_FRM_SECT                         = "Section Data"
IDC_SECTINFO_FRM_OPTN                         = "Table Option"
IDS_DGN_SECTINFO_NAME                         = "Section Name"
IDC_SECTINFO_BTN_WDTH                         = "Adjust Column Width"
IDC_SECTINFO_CHK_USER                         = "Calc. as User Section"

////// IDD_DGN_SECT_INFO_DEC_DLG
IDD_DGN_SECT_INFO_DEC_DLG                     = "Set Decimal Places"
IDC_SECTINFO_DEC_FRM_PLCS                     = "Decimal Places"
IDC_SECTINFO_DEC_LBL_SECT                     = "Section Size"
IDC_SECTINFO_DEC_LBL_AREA                     = "Area"
IDC_SECTINFO_DEC_LBL_WGHT                     = "Weight"
IDC_SECTINFO_DEC_LBL_INER                     = "Moment of Inertia"
IDC_SECTINFO_DEC_LBL_MDLS                     = "Section Modulus"
IDC_SECTINFO_DEC_LBL_GRTN                     = "Radius of Gyration"
IDC_SECTINFO_DEC_LBL_TORS                     = "Torsional Constant"
IDC_SECTINFO_DEC_LBL_WARP                     = "Warping Constant"

//////IDD_DGN_BATCH_DESIGN
IDD_DGN_BATCH_DESIGN                          = "Batch Design"
IDC_DGN_BD_FRAME_RC                           = "RC"
IDC_DGN_BD_FRAME_SRC                          = "SRC"
IDC_DGN_BD_FRAME_ALU                          = "Aluminum"
IDC_DGN_BD_FRAME_RFM                          = "Reinforce"
IDC_DGN_BD_RC_SLAB_CHK                        = "Slab"
IDC_DGN_BD_RC_BEAM_CHK                        = "Beam"
IDC_DGN_BD_RC_COLM_CHK                        = "Column"
IDC_DGN_BD_RC_GCOL_CHK                        = "Column (General)"
IDC_DGN_BD_RC_SWAL_CHK                        = "Shear Wall"
IDC_DGN_BD_RC_GWAL_CHK                        = "Shear Wall (Combined)"
IDC_DGN_BD_RC_FOOT_CHK                        = "Footing"
IDC_DGN_BD_RC_RRCF_CHK                        = "Footing (Combined)"
IDC_DGN_BD_RC_CBSF_CHK                        = "Footing (Strip)"
IDC_DGN_BD_RC_BWAL_CHK                        = "Basement Wall"
IDC_DGN_BD_RC_BUTT_CHK                        = "Buttress"
IDC_DGN_BD_RC_STAI_CHK                        = "Stair"
IDC_DGN_BD_RC_CORB_CHK                        = "Corbel/Bracket"
IDC_DGN_BD_RC_URRW_CHK                        = "Retaining Wall"
IDC_DGN_BD_RC_BELT_CHK                        = "Beam Table"
IDC_DGN_BD_RC_SLLT_CHK                        = "Slab Table"
IDC_DGN_BD_FRAME_STEEL                        = "Steel"
IDC_DGN_BD_ST_BNCO_CHK                        = "Beam && Column"
IDC_DGN_BD_ST_BOCO_CHK                        = "Bolt Connection"
IDC_DGN_BD_ST_BAPL_CHK                        = "Base Plate"
IDC_DGN_BD_ST_CRAN_CHK                        = "Crane Girder"
IDC_DGN_BD_ST_PURL_CHK                        = "Purlin && Girth"
IDC_DGN_BD_ST_WEBO_CHK                        = "Web Opening"
IDC_DGN_BD_ST_STAI_CHK                        = "Steel Stair"
IDC_DGN_BD_ST_WELD_CHK                        = "Welding"
IDC_DGN_BD_ST_EMBP_CHK                        = "Embedded Plate"
IDC_DGN_BD_SR_COMP_CHK                        = "Composite Beam"
IDC_DGN_BD_SR_COLM_CHK                        = "Column"
IDC_DGN_BD_SR_CFTC_CHK                        = "CFT Column"
IDC_DGN_BD_SR_BASE_CHK                        = "Base Plate"
IDC_DGN_BD_AL_BEAM_CHK                        = "Beam && Column"
IDC_DGN_BD_AL_MULI_CHK                        = "Beam && Column (General)"
IDC_DGN_BATCHDGN_BTN_SELECT_ALL               = "All..."
IDC_DGN_BATCHDGN_BTN_SELECT_NONE              = "None..."
IDC_DGN_BATCHDGN_BTN_CLOSE                    = "Close"
IDC_DGN_BATCHDGN_PROG                         = "Prepare Batch Design"

/// IDD_DGN_BATCH_PRINT_DLG
IDD_DGN_BATCH_PRINT_DLG                       = "Batch Print"
IDC_BPRINT_FRAME_DWG                          = "Drawing File"
IDC_BPRINT_CHK_DWG                            = "Drawing List"
IDC_BPRINT_FRAME_QUICK                        = "Quick Report"
IDC_BPRINT_CHK_DETAIL                         = "Detail"
IDC_BPRINT_CHK_SUMMARY                        = "Summary"
IDC_BPRINT_CHK_INPUT                          = "Input List"
IDC_BPRINT_FRAME_CONTENT                      = "Report Content"
IDC_BPRINT_FRAME_SELECT_MEMB                  = "Select member type to export"
IDC_BPRINT_BTN_SELECT_ALL                     = "All"
IDC_BPRINT_BTN_UNSELECT_ALL                   = "None"
IDC_BPRINT_BTN_PRINT                          = "Print"
IDC_BPRINT_BTN_CLOSE                          = "Close"

///// IDD_DGN_CHECK_MODE_DLG
IDC_DGN_REPORT_BTN_PRINT                      = "Print..."
IDC_DGN_REPORT_BTN_SAVE                       = "Save..."
IDC_DGN_REPORT_BTN_RPRT                       = "Report..."
IDC_DGN_REPORT_BTN_OPTN                       = "Option..."
IDC_DGN_REPORT_RADIO_DET                      = "Detail"
IDC_DGN_REPORT_RADIO_SUM                      = "Summary"
IDC_DGN_REPORT_CHECK_INP                      = "Include Input Data"
IDC_DGN_REPORT_VIEW                           = "Report View"
IDC_DGN_REPORT_ZOOM_SCALE                     = "Zoom Scale"
IDC_DGN_REPORT_CONTENT_TYPE                   = "Content Type"

////// IDD_DGN_CHECK_OPT_DLG
IDD_DGN_CHECK_OPT_DLG                         = "Check Option"
IDC_DGN_CHKOP_BTN_CLOSE                       = "&Close"
IDC_DGN_CHKOP_BTN_DEFAULT                     = "&Default"

//// IDD_DGN_CHECK_OPT_RCS_DLG
IDC_DGN_CHKOP_CHK_SLAB_LOAD                   = "Check Design Load ( Live Load ≤ %d x Dead Load )"
IDC_DGN_CHKOP_CHK_URBE_SPACE                  = "Check Rebar Space by Crack"
IDC_DGN_CHKOP_CHK_URBW_SPACE                  = "Check Rebar Space by Crack ( 1 Way Wall )"
IDC_DGN_CHKOP_CHK_URBU_SPACE                  = "Check Rebar Space by Crack"
IDC_DGN_CHKOP_FRAME_SLAB                      = "Slab"
IDC_DGN_CHKOP_FRAME_BEAM                      = "Beam"
IDC_DGN_CHKOP_FRAME_BASEMEMT                  = "Basement Wall"
IDC_DGN_CHKOP_FRAME_BUTTRESS                  = "Buttress"
IDC_DGN_CHKOP_CHK_SLAB_SPACE                  = "Check Rebar Space by Crack ( 1 Way Slab )"
IDC_DGN_CHKOP_CHK_URST_SPACE                  = "Check Rebar Space by Crack"
IDC_DGN_CHKOP_FRAME_STAIR                     = "Stair"

//// IDD_DGN_CHECK_OPT_RBS_DLG
IDD_DGN_CHECK_OPT_RBS_DLG                     = "Rebar Space"
IDC_DGN_CHKOP_RBSP_CHK_RBSP                   = "Check Main Rebar Spacing By Material"

////// IDD_DGN_PREF_DESIGN_DLG
IDC_DGN_PREF_BTN_DEFAULT_DESIGN               = "Default"

///// IDD_DGN_PREF_DESIGN_RC1_DLG
IDC_DGN_PREF_DESIGN_FRAME_SLAB                = "Slab"
IDC_DGN_PREF_DESIGN_CHECK_GSLAB               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GSLAB_T             = "Max. Thick"
IDC_DGN_PREF_DESIGN_FRAME_COLUMN              = "Column"
IDC_DGN_PREF_DESIGN_CHECK_GURCO               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GURCO_B             = "Max. Width"
IDC_DGN_PREF_DESIGN_CHECK_GURCO_D             = "Max. Height"
IDC_DGN_PREF_DESIGN_CHECK_GURCO_R             = "Max. Rho"
IDC_DGN_PREF_DESIGN_CHECK_GURCO_GEN           = "Use Design Method of Gen/ADS"
IDC_DGN_PREF_DESIGN_FRAME_BASEMENTWALL        = "Basement Wall"
IDC_DGN_PREF_DESIGN_CHECK_GURBW               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GURBW_T             = "Max. Thick"
IDC_DGN_PREF_DESIGN_CHECK_GURBW_SHEAR         = "Apply Shear Reinforcement"
IDC_DGN_PREF_DESIGN_FRAME_FOOTING             = "Footing"
IDC_DGN_PREF_DESIGN_CHECK_GUFDN               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GUFDN_T             = "Max. Thick"
IDC_DGN_PREF_DESIGN_LABEL_GUCBF               = "Combined Footing"
IDC_DGN_PREF_DESIGN_CHECK_GUCBF               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GUCBF_T             = "Max. Thick"
IDC_DGN_PREF_DESIGN_FRAME_STAIR               = "Stair"
IDC_DGN_PREF_DESIGN_CHECK_GURST               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GURST_T             = "Max. Thick"
IDC_DGN_PREF_DESIGN_FRAME_CORBEL              = "Corbel/Bracket"
IDC_DGN_PREF_DESIGN_CHECK_GURCB               = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_GURCB_B             = "Max. Width"
IDC_DGN_PREF_DESIGN_CHECK_GURCB_D             = "Max. Height"
IDC_DGN_PREF_DESIGN_LABEL_GURBW_REBAR         = "Rebar"
IDC_DGN_PREF_DESIGN_LABEL_GURBW_REBAR2        = "~"
IDC_DGN_PREF_DESIGN_LABEL_GURCO_R             = "%"

/////// IDD_DGN_PREF_DESIGN_RC2_DLG
IDC_DGN_PREF_DESIGN_FRAME_BEAM                = "Beam"
IDC_DGN_PREF_DESIGN_CHECK_URBE                = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_URBE_B              = "Max. Width"
IDC_DGN_PREF_DESIGN_CHECK_URBE_D              = "Max. Height"
IDC_DGN_PREF_DESIGN_CHECK_URBE_LEGNO          = "Leg No. by Width"
IDC_DGN_PREF_DESIGN_BTN_URBE_ADD              = "Add"
IDC_DGN_PREF_DESIGN_BTN_URBE_INS              = "Insert"
IDC_DGN_PREF_DESIGN_BTN_URBE_DEL              = "Delete"
IDC_DGN_PREF_DESIGN_CHECK_URBE_NO             = "Max. Layer No"
IDC_DGN_PREF_DESIGN_FRAME_BUTRESS             = "Buttress"
IDC_DGN_PREF_DESIGN_CHECK_URBU                = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_URBU_B              = "Max. Width"
IDC_DGN_PREF_DESIGN_CHECK_URBU_D              = "Max. Height"
IDC_DGN_PREF_DESIGN_CHECK_URBU_LEGNO          = "Leg No. by Width"
IDC_DGN_PREF_DESIGN_BTN_URBU_ADD              = "Add"
IDC_DGN_PREF_DESIGN_BTN_URBU_INS              = "Insert"
IDC_DGN_PREF_DESIGN_BTN_URBU_DEL              = "Delete"
IDC_DGN_PREF_DESIGN_CHECK_URBU_NO             = "Max. Layer No"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_RC2           = "Default"
IDC_DGN_PREF_DESIGN_FRAME_URBE_STIRRUP        = "Stirrup"
IDC_DGN_PREF_DESIGN_LABEL_URBE_BAR            = "Rebar "
IDC_DGN_PREF_DESIGN_FRAME_URBU_STIRRUP        = "Stirrup"
IDC_DGN_PREF_DESIGN_LABEL_URBU_REBAR          = "Rebar "

/// IDD_DGN_PREF_DESIGN_RC3_DLG
IDC_DGN_PREF_DESIGN_FRAME_STRIP_FOOTING       = "Strip Footing"
IDC_DGN_PREF_DESIGN_CHECK_URSF                = "Change Section by Design"
IDC_DGN_PREF_DESIGN_CHECK_URSF_B              = "Max. Width"
IDC_DGN_PREF_DESIGN_CHECK_URSF_D              = "Max. Height"
IDC_DGN_PREF_DESIGN_CHECK_URSF_LEGNO          = "Leg No. by Width"
IDC_DGN_PREF_DESIGN_BTN_URSF_ADD              = "Add"
IDC_DGN_PREF_DESIGN_BTN_URSF_INS              = "Insert"
IDC_DGN_PREF_DESIGN_BTN_URSF_DEL              = "Delete"
IDC_DGN_PREF_DESIGN_CHECK_URSF_NO             = "Max. Layer No"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_RC3           = "Default"
IDC_DGN_PREF_DESIGN_FRAME_URSF_STIRRUP        = "Stirrup"

/// IDD_DGN_PREF_DESIGN_RFM_DLG
IDC_DGN_PREF_DESIGN_FRAME_UFSL                = "Slab"
IDC_DGN_PREF_DESIGN_CHECK_UFSL                = "Change Size by Design"
IDC_DGN_PREF_DESIGN_CHECK_UFSL_B              = "Max. Size"
IDC_DGN_PREF_DESIGN_CHECK_UFSL_NO             = "Max. Pieces"
IDC_DGN_PREF_DESIGN_FRAME_UFBE                = "Beam"
IDC_DGN_PREF_DESIGN_CHECK_UFBE                = "Change Size by Design"
IDC_DGN_PREF_DESIGN_CHECK_UFBE_B              = "Max. Size"
IDC_DGN_PREF_DESIGN_CHECK_UFBE_NO             = "Max. Pieces"
IDC_DGN_PREF_DESIGN_FRAME_UFCO                = "Column"
IDC_DGN_PREF_DESIGN_CHECK_UFCO_NO             = "Max. Pieces"
IDC_DGN_PREF_BTN_DEFAULT_DESIGN_RFM           = "Default"

/////// IDD_DGN_PREF_WORD_DLG
IDS_DGN_WORD_STYLE_NAME                       = "Style Name"
IDS_DGN_WORD_STYLE_FONT_NAME                  = "Font Name"
IDS_DGN_WORD_STYLE_FONT_SIZE                  = "Size"
IDS_DGN_WORD_STYLE_FONT_COLOR                 = "Color"
IDS_DGN_WORD_STYLE_FONT_BOLD                  = "Bold"
IDS_DGN_WORD_STYLE_FONT_ITALIC                = "Italic"
IDS_DGN_WORD_STYLE_FONT_UNDERLINE             = "Underline"

////// IDD_DGN_LINK_DATABASE_DLG
IDD_DGN_LINK_DATABASE_DLG                     = "Link DataBase"

////// IDD_DGN_LINK_OPTION_DLG
IDD_DGN_LINK_OPTION_DLG                       = "Link Option"
IDC_LINK_TYPE_TEXT                            = "Link Type"
IDC_LINK_OPT_RADIO_SECTION                    = "Link by Section"
IDC_LINK_OPT_RADIO_MEMBER                     = "Link by Member"
IDC_LINK_OPT_CHECK_SECTION                    = "Consider Material Additionally"
IDC_LINK_OPT_BTN_DEFAULT                      = "Default"
IDC_LINK_OPT_BTN_OK                           = "&OK"
IDC_LINK_OPT_BTN_APPLY                        = "&Apply"
IDC_LINK_OPT_BTN_CANCEL                       = "&Cancel"

////// IDD_DGN_LINK_OPTION_ALU_DLG
IDC_LINK_OPT_TXT_GUAAG                        = "Beam/Column"
IDC_LINK_OPT_TXT_GUAMT                        = "Beam/Column (General)"

////// IDD_DGN_LINK_OPTION_NAME_DLG
IDC_FORMAT_TEXT                               = "Format String : "
IDC_FORMAT__S                                 = "%S : Section Name"
IDC_FORMAT__N                                 = "%N : Element / Node Number"
IDC_FORMAT__F                                 = "%F : Story Name"
IDC_FORMAT__M                                 = "%M : Material Name"
IDC_LINK_OPT_CHECK_NAME                       = "Remove Character in Story Name"
IDC_LINK_OPT_TXT_ABOVE                        = "Above Ground Level : "
IDC_LINK_OPT_TXT_BELOW                        = "Below Ground Level : "

////// IDD_DGN_LINK_OPTION_RCS_DLG
IDC_LINK_OPT_TXT_GURBE                        = "Beam"
IDC_LINK_OPT_TXT_GURCO                        = "Column"
IDC_LINK_OPT_TXT_GURGC                        = "Column (General)"
IDC_LINK_OPT_TXT_GURSW                        = "Shear Wall"
IDC_LINK_OPT_TXT_GURDW                        = "Combined Wall"
IDC_LINK_OPT_TXT_GUFDN                        = "Footing"
IDC_LINK_OPT_TXT_GURSF                        = "Strip Footing"
IDC_LINK_OPT_TXT_GURCF                        = "Combined Footing"

IDS_LINK_OPT_TAB_LINK_DATA                    = "Down Link"
IDS_LINK_OPT_TAB_UPLINK_DATA                  = "Up Link"
IDS_LINK_OPT_TAB_MEMBER_DATA                  = "Memb.( Down Link )"
IDS_LINK_OPT_TAB_MEMBER_DATA_UP               = "Memb.( Up Link )"
IDS_LINK_OPT_LINK_SETTING                     = "Link Setting"
IDS_LINK_OPT_LINK_TYPE_MEMB                   = "Link Type by Member"
IDS_LINK_OPT_LINK_APPLY_LINK_BY_MEMBER        = "Apply Link Option by Member"
IDS_LINK_OPT_LINK_BY_SECTION                  = "Link by Section"
IDS_LINK_OPT_LINK_BY_MEMBER                   = "Link by Member"
IDS_LINK_OPT_LINK_CONSIDER_MATL               = "Consider Material Additionally"
IDS_LINK_OPT_LINK_LCOM_TYPE                   = "Load Combination Type"
IDS_LINK_OPT_LINK_LCOM_REMO                   = "Remove Duplicate Load Comb."
IDS_LINK_OPT_LINK_FORC_TYPE                   = "Force Type"
IDS_LINK_OPT_TXT_FORCE_TYPE                   = "Force Type"
IDS_LINK_OPT_LINK_DESIGN_FORCE_TYPE           = "Design Force Type"

////// IDD_DGN_LINK_OPTION_SRC_DLG
IDC_LINK_OPT_TXT_GUCCO                        = "Column"
IDC_LINK_OPT_TXT_GUCFT                        = "CFT Column"
IDC_LINK_OPT_TXT_GUCBP                        = "Base Plate"

////// IDD_DGN_LINK_OPTION_STL_DLG
IDC_LINK_OPT_TXT_GUSSG                        = "Beam/Column"
IDC_LINK_OPT_TXT_GUSBC                        = "Bolt Connection"
IDC_LINK_OPT_TXT_GUSBP                        = "Base Plate"
IDC_LINK_OPT_TXT_GUSWE                        = "Welding"
IDC_LINK_OPT_TXT_GUSWE_POS                    = "Position"
IDC_LINK_OPT_TXT_GUSEP                        = "Embedded Plate"
IDC_LINK_OPT_TXT_GESBC_TYPE                   = "Type"
IDC_LINK_OPT_TXT_GESMC                        = "Moment Bolt Conn."

////// IDD_DGN_LINK_OPTION_RFM_DLG
IDC_LINK_OPT_TXT_GUFBE                        = "Beam"
IDC_LINK_OPT_TXT_GUFCO                        = "Column"

////// IDD_DGN_UPLINK_OPTN_LINK_DLG
IDC_DGN_FRM_LINK_DATA                         = "Link Data"
IDC_DGN_CHK_DATA_SECT                         = "Change Section ( Beam / Column / Brace )"
IDC_DGN_RDO_SECT_ANAL                         = "by Section for Analysis"
IDC_DGN_RDO_SECT_DSGN                         = "by Section for Design"
IDC_DGN_CHK_DATA_THCK                         = "Change Thickness ( Wall )"
IDC_DGN_RDO_THCK_ANAL                         = "by Thickness for Analysis"
IDC_DGN_RDO_THCK_DSGN                         = "by Thickness for Design"
IDC_DGN_CHK_DATA_MATL                         = "Change Material"
IDC_DGN_RDO_MATL_ANAL                         = "by Material for Analysis"
IDC_DGN_RDO_MATL_DSGN                         = "by Material for Design"
IDC_DGN_CHK_DATA_RBAR                         = "Change Rebar Arrangement"

////// IDD_DGN_LIST_SOIL_DLG
IDD_DGN_LIST_SOIL_DLG                         = "Soil Properties"
IDD_DGN_LIST_SOIL_DLG_STATIC                  = "Soil Properties ( Static Load )"
IDD_DGN_LIST_SOIL_DLG_SEISMIC                 = "Soil Properties ( Seismic Load )"
IDC_DGN_SELECT_MEMBER_GRID_TEXT               = "Select Member"
IDC_DGN_SELECT_BTN_ALL                        = "All"
IDC_DGN_SELECT_BTN_NONE                       = "None"
IDC_DGN_SOIL_CHK_TEXT                         = "Soil Properties"
IDC_DGN_SOIL_CHK_VALUE                        = "N Value"
IDC_DGN_SOIL_CHK_PRESSURE                     = "Active Soil Pressure"
IDC_DGN_SOIL_CHK_KH                           = "User KH"
IDC_DGN_SOIL_CHK_DISP                         = "User Releative Displacement"
IDC_DGN_SOIL_BTN_SRA                          = "Import\nSTF File ..."
IDC_DGN_SOIL_BTN_ADD                          = "Add"
IDC_DGN_SOIL_BTN_DEL                          = "Delete"
IDC_DGN_SOIL_BTN_INS                          = "Insert"
IDC_DGN_SOIL_BTN_APPLY                        = "Apply"
IDC_DGN_SOIL_BTN_CANCEL                       = "Cancel"
IDC_DGN_SOIL_PROPER_FRM                       = "Soil Properties"
IDC_DGN_SOIL_BTN_GET_LOAD                     = "Get Data from Static Pressure Load"
IDC_DGN_SOIL_BTN_GET_STATIC                   = "Get Data from Static Pressure Load"
IDC_DGN_SOIL_BTN_GET_SEISMIC                  = "Get Data from Seismic Pressure Load"
IDC_DGN_SOIL_BTN_GET_MEMB                     = "Get Data from Member Data ..."

////// IDD_DGN_LIST_USER_DLG
IDD_DGN_LIST_USER_DLG                         = "Soil Force"
IDC_DGN_SELECT_MEMB_TEXT                      = "Select Member"
IDC_DGN_USER_SOIL_FORCE_TEXT                  = "Soil Force"
IDC_DGN_USER_BTN_ADD                          = "Add"
IDC_DGN_USER_BTN_DEL                          = "Delete"
IDC_DGN_USER_BTN_INS                          = "Insert"
IDC_DGN_USER_BTN_APPLY                        = "Apply"
IDC_DGN_USER_BTN_CANCEL                       = "Cancel"

/////// IDD_DGN_OPT_RAT_DLG
IDC_DGN_OPTION_TARGET_RATIO                   = "Ratio"
IDC_DGN_OPTION_SET_TARGET_RATIO_BY_MEMBER     = "※ Set Design Target Ratio by Member"
IDC_DGN_OPTION_BY_N_MEMBER                    = "By\nMember"
IDC_DGN_OPTION_COMP_N_DESIGN                  = "Comp.\nDesign"
IDC_DGN_OPTION_TENS_N_DESIGN                  = "Tens.\nDesign"
IDC_DGN_OPTION_BEND_N_DESIGN                  = "Bending\nDesign"
IDC_DGN_OPTION_SHEAR_N_DESIGN                 = "Shear\nDesign"
IDC_DGN_OPTION_OTHER_N_DESIGN                 = "Etc.\nDesign"

////// IDD_DGN_OPT_ALU_DLG
IDC_OPTION_ALU_COMBO_DESIGN_CODE_TEXT         = "Design Code"
IDC_OPTION_ALU_TARGET_RATIO_TEXT              = "Target ratio for design"
IDC_OPTION_ALU_COMBO_RATIO_BENDING_TEXT       = "Flexural (Bending)"
IDC_OPTION_ALU_COMBO_RATIO_COMP_TEXT          = "Compression"
IDC_OPTION_ALU_COMBO_RATIO_TENSION_TEXT       = "Tension"
IDC_OPTION_ALU_COMBO_RATIO_SHEAR_TEXT         = "Shear && Torsion"
IDC_OPTION_ALU_COMBO_RATIO_OTHERS_TEXT        = "Others"

////// IDD_DGN_OPT_CFS_DLG
IDC_OPTION_CFS_COMBO_DESIGN_CODE_TEXT         = "Design Code"
IDC_OPTION_CFS_TARGET_RATIO_TEXT              = "Target ratio for design"
IDC_OPTION_CFS_COMBO_RATIO_BENDING_TEXT       = "Flexural (Bending)"
IDC_OPTION_CFS_COMBO_RATIO_COMP_TEXT          = "Compression"
IDC_OPTION_CFS_COMBO_RATIO_TENSION_TEXT       = "Tension"
IDC_OPTION_CFS_COMBO_RATIO_SHEAR_TEXT         = "Shear && Torsion"
IDC_OPTION_CFS_COMBO_RATIO_OTHERS_TEXT        = "Others"

////// IDD_DGN_CODE_TABLE_DLG
IDD_DGN_CODE_TABLE_DLG                        = "Design Code Table"

////// IDD_DGN_CODE_DLG
IDD_DGN_CODE_DLG                              = "Design Code"
IDC_GUOPT_FRAME_DGN_CODE                      = "Design Code"
IDC_GUOPT_FRAME_LOADCODE                      = "Design Load"
IDC_GUOPT_COMBO_LOAD_WIND_TEXT                = "Wind Load"
IDC_GUOPT_COMBO_LOAD_SNOW_TEXT                = "Snow Load"
IDC_GUOPT_BTN_APPLY                           = "Apply"
IDC_GUOPT_BTN_CLOSE                           = "Close"

////// IDD_DGN_DATABASE_DLG
IDD_DGN_DATABASE_DLG                          = "Data Base"
IDC_GUOPT_FRAME_UNIT_SYSTEM                   = "Unit System"
IDC_USER_UNIT_RADIO                           = "User Defined"
IDC_SYSTEM_UNIT_RADIO                         = "Pre-defined"
IDC_GUOPT_UNIT_SYSTEM_TEXT                    = "Unit System"
IDC_GUOPT_FRAME_STL_DB                        = "Steel DB"
IDC_GUOPT_STL_DB_MATERIAL                     = "Material"
IDC_GUOPT_STL_DB_SECTION                      = "Section"
IDC_GUOPT_FRAME_ALU_DB                        = "Aluminum DB"
IDC_GUOPT_ALU_DB_MATERIAL                     = "Material"
IDC_GUOPT_ALU_DB_SECTION                      = "Section"
IDC_GUOPT_FRAME_RFM_DB                        = "Reinforcement DB"
IDC_GUOPT_RFM_DB_MATL_FRP                     = "Material ( FRP )"
IDC_GUOPT_RFM_DB_MATL_STL                     = "Material ( Steel )"

////// IDD_DGN_OPT_RCS_DLG
IDC_OPTION_RCS_COMBO_DESIGN_CODE_TEXT         = "Design Code"
IDC_OPTION_RCS_TARGET_RATIO_TEXT              = "Target ratio for design"
IDC_OPTION_RCS_COMBO_RATIO_BENDING_TEXT       = "Flexural (Bending)"
IDC_OPTION_RCS_COMBO_RATIO_COMP_TEXT          = "Compression"
IDC_OPTION_RCS_COMBO_RATIO_TENSION_TEXT       = "Tension"
IDC_OPTION_RCS_COMBO_RATIO_SHEAR_TEXT         = "Shear && Torsion"
IDC_OPTION_RCS_COMBO_RATIO_OTHERS_TEXT        = "Others"

////// IDD_DGN_OPT_RCS_ADD_DLG
IDD_DGN_OPT_RCS_ADD_DLG                       = "Additional Design Information"
IDC_OPTION_RCS_DGNCODE_TEXT                   = "Design Code : "
IDC_OPTION_RCS_PARTIAL_FACTOR_TEXT            = "Partial Safety Factors"
IDC_OPTION_RCS_EDT_FACTOR_GAMMAC_TEXT         = "Concrete ( γc )"
IDC_OPTION_RCS_EDT_FACTOR_GAMMAS_TEXT         = "Steel ( γs )"
IDC_OPTION_RCS_EDT_FACTOR_ALPHACC_TEXT        = "αcc"
IDC_OPTION_RCS_DELTA_FACTOR_TEXT              = "Etc"
IDC_OPTION_RCS_EDT_FACTOR_DELTA_TEXT          = "Redistribution Ratio ( δ )"

////// IDD_DGN_OPT_STL_DLG
IDC_OPTION_STEEL_COMBO_DESIGN_CODE_TEXT       = "Design Code"
IDC_OPTION_STEEL_TARGET_RATIO_TEXT            = "Target ratio for design"
IDC_OPTION_STEEL_COMBO_RATIO_BENDING_TEXT     = "Flexural (Bending)"
IDC_OPTION_STEEL_COMBO_RATIO_COMP_TEXT        = "Compression"
IDC_OPTION_STEEL_COMBO_RATIO_TENSION_TEXT     = "Tension"
IDC_OPTION_STEEL_COMBO_RATIO_SHEAR_TEXT       = "Shear && Torsion"
IDC_OPTION_STEEL_COMBO_RATIO_OTHERS_TEXT      = "Others"

/////// IDD_DGN_OPT_STL_ADD_DLG
IDD_DGN_OPT_STL_ADD_DLG                       = "Additional Design Information"
IDC_OPTION_STL_DGNCODE_TEXT                   = "Design Code : "
IDC_OPTION_STL_PARTIAL_FACTOR_TEXT            = "Partial Safety Factors"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM0_TEXT        = "γM0"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM1_TEXT        = "γM1"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM2_C_TEXT      = "γM2 ( Cross Section ) "
IDC_OPTION_STL_EDT_FACTOR_GAMMAM2_TEXT        = "γM2 ( Bolts, Welds ) "
IDC_OPTION_STL_EDT_FACTOR_GAMMAMU_TEXT2       = "γMu"
IDC_OPTION_STL_EDT_FACTOR_ETA_TEXT3           = "ŋ"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM0_TEXT2       = "βj(Foundation Joint Material)"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM1_TEXT2       = "√(Ac1/Ac0)"
IDC_OPTION_STL_EDT_FACTOR_GAMMAM2_C_TEXT2     = "BP and Grout Friction"
IDC_DGN_OPT_STL_ADD_OK                        = "OK"
IDC_DGN_OPT_STL_ADD_CANCEL                    = "Cancel"

////// IDD_DGN_OPT_SRC_DLG
IDC_OPTION_SRC_COMBO_DESIGN_CODE_TEXT         = "Design Code"
IDC_OPTION_SRC_TARGET_RATIO_TEXT              = "Target ratio for design"
IDC_OPTION_SRC_COMBO_RATIO_BENDING_TEXT       = "Flexural (Bending)"
IDC_OPTION_SRC_COMBO_RATIO_COMP_TEXT          = "Compression"
IDC_OPTION_SRC_COMBO_RATIO_TENSION_TEXT       = "Tension"
IDC_OPTION_SRC_COMBO_RATIO_SHEAR_TEXT         = "Shear && Torsion"
IDC_OPTION_SRC_COMBO_RATIO_OTHERS_TEXT        = "Others"

/////// IDD_DGN_OPT_SRC_ADD_DLG
IDD_DGN_OPT_SRC_ADD_DLG                       = "Additional Design Information"

////// IDD_DGN_OPT_RFM_DLG
IDC_OPTION_RFM_COMBO_DESIGN_CODE_TEXT         = "Design Code"
IDC_OPTION_RFM_TARGET_RATIO_TEXT              = "Target ratio for design"
IDC_OPTION_RFM_COMBO_RATIO_BENDING_TEXT       = "Flexural (Bending)"
IDC_OPTION_RFM_COMBO_RATIO_COMP_TEXT          = "Compression"
IDC_OPTION_RFM_COMBO_RATIO_TENSION_TEXT       = "Tension"
IDC_OPTION_RFM_COMBO_RATIO_SHEAR_TEXT         = "Shear && Torsion"
IDC_OPTION_RFM_COMBO_RATIO_OTHERS_TEXT        = "Others"

////// IDD_DGN_CONVERT_DLG
IDD_DGN_CONVERT_DLG                           = "Convert to SRC Column"
IDC_CONVERT_FRAME                             = "Select member"
IDC_CONVERT_BTN_SELALL                        = "All"
IDC_CONVERT_BTN_INVERT                        = "Invert"
IDC_CONVERT_BTN_SELNON                        = "None"
IDC_CONVERT_BTN_CONVERT                       = "Convert"
IDC_CONVERT_BTN_CLOSE                         = "Close"

////// IDD_DGN_DECK_SECT_DLG
IDC_DGN_CHK_USE                               = "Use Deck Plate"
IDC_DGN_LABEL_DECK                            = "Section"
IDC_DGN_LABEL_DIRECT                          = "Direction"
IDD_DGN_DECK_PROP_DLG                         = "Deck Properties"

////// IDD_DGN_EXPORT_ALU_DLG
IDC_EXPORT_ALU_BTN_ALL                        = "All"
IDC_EXPORT_ALU_BTN_NONE                       = "None"

////// IDD_DGN_EXPORT_DLG
IDD_DGN_EXPORT_DLG                            = "Export Document"
IDC_EXPORT_FRAME_FILE                         = "Folder to Export"
IDC_EXPORT_FRAME_DRAWING                      = "Drawing File"
IDC_EXPORT_DWG_CHK                            = "Drawing List (*.dwg)"
IDC_EXPORT_FRAME_WORD                         = "Word Report"
IDC_EXPORT_CHK_WORD_DETAIL                    = "Detail"
IDC_EXPORT_CHK_WORD_SUMMARY                   = "Summary"
IDC_EXPORT_CHK_WORD_INPUT                     = "Input List"
IDC_EXPORT_FRAME_QUICK                        = "Quick Report:"
IDC_EXPORT_CHK_QUICK_BMP                      = "BMP"
IDC_EXPORT_CHK_QUICK_EMF                      = "EMF"
IDC_EXPORT_CHK_QUICK_JPG                      = "JPG"
IDC_EXPORT_CHK_QUICK_DETAIL                   = "Detail"
IDC_EXPORT_CHK_QUICK_SUMMARY                  = "Summary"
IDC_EXPORT_CHK_QUICK_INPUT                    = "Input List"
IDC_BPRINT_TEXT                               = "Report Content"
IDC_BPRINT_PROJECT_RDO                        = "Project Mode"
IDC_BPRINT_SIMPLE_RDO                         = "Simple Mode"
IDC_EXPORT_MEMBER_TAB_TEXT                    = "Select member type to export"
IDC_EXPORT_BTN_SELECT_ALL                     = "All"
IDC_EXPORT_BTN_UNSELECT_ALL                   = "None"
IDC_EXPORT_BTN_EXPORT                         = "Export"
IDC_EXPORT_BTN_CLOSE                          = "Close"

////// IDD_DGN_EXPORT_ETC_DLG
IDC_EXPORT_ETC_FRAME_LOAD                     = "System for Design Load"
IDC_EXPORT_ETC_RADIO_RCS                      = "RC"
IDC_EXPORT_ETC_RADIO_STL                      = "Steel"
IDC_EXPORT_ETC_RADIO_SRC                      = "SRC"
IDC_EXPORT_ETC_RADIO_ALU                      = "Aluminum"
IDC_EXPORT_ETC_LABEL_CODE                     = "Design Code : "
IDC_EXPORT_ETC_BTN_ALL                        = "All"
IDC_EXPORT_ETC_BTN_NONE                       = "None"

////// IDD_DGN_EXPORT_RCS_DLG
IDC_EXPORT_RCS_BTN_ALL                        = "All"
IDC_EXPORT_RCS_BTN_NONE                       = "None"

////// IDD_DGN_EXPORT_SRC_DLG
IDC_EXPORT_SRC_BTN_ALL                        = "All"
IDC_EXPORT_SRC_BTN_NONE                       = "None"

////// IDD_DGN_EXPORT_STL_DLG
IDC_EXPORT_STL_BTN_ALL                        = "All"
IDC_EXPORT_STL_BTN_NONE                       = "None"

////// IDD_DGN_TORSION_DLG
IDD_DGN_TORSION_DLG                           = "Torsion Design Data ( Open Section )"
IDC_DGN_TORSION_FRM_MEMB                      = "Select Member"
IDC_DGN_TORSION_BTN_ALL                       = "All"
IDC_DGN_TORSION_BTN_NON                       = "None"
IDC_DGN_TORSION_FRM_CASE                      = "Design Case"
IDC_DGN_TORSION_LBL_CASE                      = "Design Case"
IDC_DGN_TORSION_LBL_SUPL                      = "Support ( Left )"
IDC_DGN_TORSION_LBL_SUPR                      = "Support ( Right )"
IDC_DGN_TORSION_LBL_DESC                      = "Description"
IDC_DGN_TORSION_FRM_FORC                      = "Concentrated Force"
IDC_DGN_TORSION_LBL_POSF                      = "Distance of Force"
IDC_DGN_TORSION_FRM_CHCK                      = "Check Position"
IDC_DGN_TORSION_CHK_POSI                      = "Adjust Position for Concentrated Force"
IDC_DGN_TORSION_BTN_ADD                       = "Add"
IDC_DGN_TORSION_BTN_DEL                       = "Delete"
IDC_DGN_TORSION_BTN_INS                       = "Insert"
IDC_DGN_TORSION_BTN_DEF                       = "Default"
IDC_DGN_TORSION_BTN_APP                       = "Apply"
IDC_DGN_TORSION_BTN_CAN                       = "Cancel"

////// IDD_DGN_UNITCON_COM1_DLG
IDC_UNITCON_FRM_COM1_TYPE                     = "Unit Type"
IDC_UNITCON_BTN_COM1_ENERGY                   = "Energy / Work"
IDC_UNITCON_BTN_COM1_ENTHALPY                 = "Enthalpy"
IDC_UNITCON_BTN_COM1_ENTROPY                  = "Entropy"
IDC_UNITCON_BTN_COM1_FORCE                    = "Force / Weight"
IDC_UNITCON_BTN_COM1_POWER                    = "Power"
IDC_UNITCON_BTN_COM1_PRESSURE                 = "Pressure / Stress"
IDC_UNITCON_BTN_COM1_WDENSITY                 = "Weight Density"
IDC_UNITCON_BTN_COM1_WEIGHT                   = "Weight per Length"
IDC_UNITCON_BTN_COM1_MOMENT                   = "Moment / Torque"
IDC_UNITCON_FRM_COM1_UNIT                     = "Unit Value"

////// IDD_DGN_UNITCON_COM2_DLG
IDC_UNITCON_FRM_COM2_TYPE                     = "Unit Type"
IDC_UNITCON_BTN_COM2_ANGLE                    = "Angle"
IDC_UNITCON_BTN_COM2_AREA                     = "Area"
IDC_UNITCON_BTN_COM2_DENSITY                  = "Density"
IDC_UNITCON_BTN_COM2_LENGTH                   = "Length"
IDC_UNITCON_BTN_COM2_MASS                     = "Mass"
IDC_UNITCON_BTN_COM2_VOLUME                   = "Volume"
IDC_UNITCON_BTN_COM2_VELOCITY                 = "Velocity / Speed"
IDC_UNITCON_BTN_COM2_TIME                     = "Time"

////// IDD_DGN_UNITCON_DLG
IDD_DGN_UNITCON_DLG                           = "Unit Converter"
IDC_DGN_UNITCON_SLIDE_TEXT                    = "Transparency"

////// IDD_DGN_UNITCON_ELEC_DLG
IDC_UNITCON_FRM_ELEC_TYPE                     = "Unit Type"
IDC_UNITCON_BTN_ELEC_CAPACITY                 = "Capacitance"
IDC_UNITCON_BTN_ELEC_CHARGE                   = "Charge"
IDC_UNITCON_BTN_ELEC_CURRENT                  = "Current"
IDC_UNITCON_BTN_ELEC_POTENTIAL                = "Potential / EMF"
IDC_UNITCON_BTN_ELEC_INDUCT                   = "Inductance"
IDC_UNITCON_BTN_ELEC_MAGFIELD                 = "Magnetic Field"
IDC_UNITCON_BTN_ELEC_MAGFLUX                  = "Magnetic Flux"
IDC_UNITCON_BTN_ELEC_RESIST                   = "Resistance"

////// IDD_DGN_UNITCON_MISC_DLG
IDC_UNITCON_FRM_MISC_TYPE                     = "Unit Type"
IDC_UNITCON_BTN_MISC_VOLFLOW                  = "Volume Flow"
IDC_UNITCON_BTN_MISC_SPECIFIC                 = "Specific Volume"
IDC_UNITCON_BTN_MISC_MASSFLOW                 = "Mass Flow"
IDC_UNITCON_BTN_MISC_INERTIA                  = "Mass Moment Inertia"
IDC_UNITCON_BTN_MISC_TEMP                     = "Temperature"

////// IDD_DGN_UNITCON_THER_DLG
IDC_UNITCON_FRM_THER_TYPE                     = "Unit Type"
IDC_UNITCON_BTN_THER_HEATCAPA                 = "Heat Capacity"
IDC_UNITCON_BTN_THER_HEATFLUX                 = "Heat Flux"
IDC_UNITCON_BTN_THER_HEATTRAN                 = "Heat Trans. Coeff."
IDC_UNITCON_BTN_THER_RADIAT                   = "Radiation Const."
IDC_UNITCON_BTN_THER_SPECIFIC                 = "Specific Heat"
IDC_UNITCON_BTN_THER_THERMAL                  = "Thermal Conduct"

////// IDD_DGN_LOAD_WIND_KR09_DLG
IDD_DGN_LOAD_WIND_KR09_DLG                    = "Wind Load ( KBC2009 )"
IDC_DGN_WIND_FRM_MEMB                         = "Select Member"
IDC_DGN_WIND_BTN_ALL                          = "All"
IDC_DGN_WIND_BTN_NON                          = "None"
IDC_DGN_WIND_FRM_WIND                         = "Wind Load"
IDC_DGN_WIND_LBL_WIND                         = "Basic Wind Speed"
IDC_DGN_WIND_LBL_DIRF                         = "Direction Factor"
IDC_DGN_WIND_LBL_TOPO                         = "Topographic Factor"
IDC_DGN_WIND_LBL_IMPO                         = "Importance Category"
IDC_DGN_WIND_LBL_SURF                         = "Surface Rough Category"
IDC_DGN_WIND_LBL_BUIL                         = "Building Type"
IDC_DGN_WIND_LBL_ROOF                         = "Roof Type"
IDC_DGN_WIND_LBL_CHCK                         = "Checking Point"
IDC_DGN_WIND_LBL_MEAN                         = "Mean Roof Height"
IDC_DGN_WIND_LBL_HAGL                         = "Height above Ground"
IDC_DGN_WIND_LBL_ANGL                         = "Roof Angle"
IDC_DGN_WIND_BTN_APPLY                        = "Apply"
IDC_DGN_WIND_BTN_CANCE                        = "Cancel"

////// IDD_DGN_LOAD_WIND_KR16_CHK_DLG
IDD_DGN_LOAD_WIND_KR16_CHK_DLG                = "Check Condition ( Simplified Method )"
IDD_DGN_LOAD_WIND_KR22_CHK_DLG                = "Check Condition ( Simplified Method )"
IDC_DGN_WIND_FRM_BLD                          = "Building Information"
IDC_DGN_WIND_LBL_H                            = "Mean Roof Height"
IDC_DGN_WIND_LBL_B                            = "Building Width"
IDC_DGN_WIND_LBL_D                            = "Building Depth"
IDC_DGN_WIND_LBL_A                            = "Floor Area"
IDC_DGN_WIND_LBL_R                            = "Roof Angle"
IDC_DGN_WIND_FRM_RES                          = "Check Result"
IDC_DGN_WIND_CHK_REGU                         = "Regular"
IDC_DGN_WIND_CHK_IRRE                         = "Irregular"
IDC_DGN_WIND_LBL_RES0                         = "Check Result"
IDC_DGN_WIND_BTN_CLOSE                        = "Close"

////// IDD_DGN_LOAD_WIND_KR16_DLG
IDD_DGN_LOAD_WIND_KR16_DLG                    = "Wind Load ( KBC2016 )"
IDC_DGN_WIND_BTN_CHECK                        = "Check Condition ..."
IDC_DGN_WIND_CHK_SIMP                         = "Apply Simplified Method"
IDC_DGN_WIND_CHK_HIGH                         = "High-Rise Building"
IDC_DGN_WIND_LBL_BLDB                         = "Building Width"
IDC_DGN_WIND_LBL_BLDD                         = "Building Depth"
IDC_DGN_WIND_LBL_ENVI                         = "Environmental Coefficient"

////// IDD_DGN_LOAD_WIND_US_DLG
IDD_DGN_LOAD_WIND_US_DLG                      = "Wind Load"
IDC_DGN_WIND_LBL_DIRE                         = "Directionality Factor"

////// IDD_FIGURE_LAYER_LNTP_DLG
IDD_FIGURE_LAYER_LNTP_DLG                     = "Line Type"
IDC_FIGURE_LAYER_LNTP_ORG_STC                 = "Original"
IDC_FIGURE_LAYER_LNTP_NEW_STC                 = "New"
IDC_FIGURE_LAYER_LNTP_OK_BTN                  = "OK"
IDC_FIGURE_LAYER_LNTP_CANCEL_BTN              = "Cancel"

// DgnFactorCbDlg
IDD_DGN_FACTOR_CB_DLG                         = "Lateral-Torsional Buckling Modification Factor ( Cb )"
IDC_DGN_FACTOR_CB_CHK_CANTI                   = "Cantilever"
IDC_DGN_FACTOR_CB_BTN_APPLY                   = "&Apply"
IDC_DGN_FACTOR_CB_BTN_CANCEL                  = "&Cancel"
IDC_MOMENT_DIAGRAM_STC                        = "Moment Diagram"
IDC_END_I_POSITION_STC                        = "End(I)"
IDC_END_J_POSITION_STC                        = "End(J)"
IDC_ONE_OF_FOUR_POSITION_STC                  = "1/4"
IDC_MID_POSITION_STC                          = "Mid"
IDC_THREE_OF_FOUR_POSITION_STC                = "3/4"
IDC_CB_FACTOR_STC                             = "Cb : "

// DgnForceDlg
IDD_DGN_FORCE_DLG                             = "Load Combinations"
IDC_DGN_FORCE_BTN_ALL                         = "&All"
IDC_DGN_FORCE_BTN_NON                         = "&None"
IDC_DGN_FORCE_BTN_INV                         = "&Invert"
IDC_DGN_FORCE_BTN_ADD                         = "&Add"
IDC_DGN_FORCE_BTN_INS                         = "&Insert"
IDC_DGN_FORCE_BTN_DEL                         = "&Delete"
IDC_DGN_FORCE_BTN_OK                          = "&OK"
IDC_DGN_FORCE_BTN_CANCEL                      = "&Cancel"

// DgnImportDlg
IDD_DGN_IMPORT_DLG                            = "Import Members"
IDC_IMPORT_BTN_SELECT_ALL                     = "Select All"
IDC_IMPORT_BTN_UNSELECT_ALL                   = "Unselect All"
IDC_IMPORT_BTN_IMPORT                         = "Import"
IDC_IMPORT_BTN_CLOSE                          = "Close"
IDC_FILE_NAME_STC                             = "File Name"
IDC_IMPORT_FRAME                              = "Select member"
IDD_DGN_IMPORT_DLG_OPEN_FILE                  = "Open file to import members."

// DgnImportPrefDlg
IDD_DGN_IMPORT_PREF_DLG                       = "Import Preference"
IDC_DGN_IMPORT_PREF_OPEN_FILE                 = "Open file to import Preference."
IDC_IMPORT_CHK_GENERAL                        = "General Information"
IDC_IMPORT_FRAME_DRAWING                      = "Drawing"
IDC_IMPORT_CHK_DRAWING_LAYER                  = "Layer Properties"
IDC_IMPORT_CHK_DRAWING_FILE                   = "File for Frame / Legend"
IDC_IMPORT_CHK_DRAWING_DWG                    = "Option for Dwg File"
IDC_IMPORT_FRAME_WORD                         = "Word"
IDC_IMPORT_CHK_WORD_STYLE                     = "Styles"
IDC_IMPORT_FRAME_PREVIEW                      = "DWG Preview"
IDC_IMPORT_CHK_PREVIEW_RBB                    = "Batch Beam"
IDC_IMPORT_CHK_PREVIEW_RBC                    = "Batch Column"
IDC_IMPORT_FRAME_DESIGN                       = "Design"
IDC_IMPORT_CHK_DESIGN_SECTION                 = "Section Increment"
IDC_IMPORT_CHK_DESIGN_SIZE_RCS                = "Section Restriction for RC"
IDC_IMPORT_CHK_DESIGN_SIZE_STL                = "Section Restriction for Steel"
IDC_IMPORT_CHK_DESIGN_SIZE_SRC                = "Section Restriction for SRC"
IDC_IMPORT_CHK_DESIGN_SMART_BB                = "Smart Design Option ( Batch Beam )"
IDC_IMPORT_CHK_DESIGN_SMART_BC                = "Smart Design Option ( Batch Column )"
IDC_IMPORT_FRAME_REBAR                        = "Rebar Option"
IDC_IMPORT_CHK_DESIGN_BAR_OPT                 = "Rebar Option for Design"
IDC_IMPORT_CHK_DESIGN_BAR_SPA                 = "Space List for Design"
IDC_IMPORT_FRAME_SECTION                      = "Section List"
IDC_IMPORT_CHK_SECTION_STL                    = "Steel Section List"
IDC_IMPORT_CHK_SECTION_ALU                    = "Aluminum Section List"
IDC_IMPORT_BTN_ALL                            = "All"
IDC_IMPORT_BTN_NONE                           = "None"
IDC_IMPORT_BTN_OK                             = "OK"
IDC_IMPORT_BTN_APPLY                          = "Apply"
IDC_IMPORT_BTN_CANCEL                         = "Cancel"

// DgnKFactorDlg
IDC_DGN_KFACTOR_BTN_APPLY                     = "&Apply"
IDC_DGN_KFACTOR_BTN_CANCEL                    = "&Cancel"
IDC_DGN_KFACTOR_FRAME                         = "K-Factor"

// DgnQuantityFormDlg
IDC_QUAN_CREA_BTN                             = "Create"
IDC_QUAN_SAVE_BTN                             = "Export to Excel ..."
IDC_QUAN_SIZE_BTN                             = "Auto Resize"
IDC_QUAN_NOTICE                               = "※ This tab show Quantity per Unit Length."

// DgnRebarDlg
IDD_DGN_REBAR_DLG                             = "Rebar Option"
IDC_OPTION_REBAR_CHECK_USE_USERLIST           = "Use user-defined rebar."
IDC_OPTION_SPACE_BTN_ADD                      = "Add"
IDC_OPTION_SPACE_BTN_REMOVE                   = "Remove"
IDC_OPTION_SPACE_CHECK_USE_USERLIST           = "Use user-defined space."
IDC_OPTION_BTN_APPLY                          = "Apply"
IDC_OPTION_BTN_CLOSE                          = "Close"
IDC_REBAR_CODE_STC                            = "Rebar Code"
IDC_REBAR_OPT_DGN_GROUP_STC                   = "Rebar Option for Design"
IDC_REBAR_SPACING_LIST_GOURP_STC              = "Spacing List"

// DgnRebarRCPageDlg
IDC_OPTION_REBAR_RC_SLAB_STC                  = "Slab"
IDC_OPTION_REBAR_RC_BEAM_COLUMN_STC           = "Beam && Girder"
IDC_OPTION_REBAR_RC_COLUMN_STC                = "Column"
IDC_OPTION_REBAR_RC_SHEAR_WALL_STC            = "Shear Wall"
IDC_OPTION_REBAR_RC_BASEMENT_WALL_STC         = "Basement Wall"
IDC_OPTION_REBAR_RC_FOOTING_STC               = "Footing"
IDC_OPTION_REBAR_RC_LABEL_UCBF1               = "Comb. Footing"
IDC_OPTION_REBAR_RC_STRIP_FOOTING_STC         = "Strip Footing"
IDC_OPTION_REBAR_RC_BUTTRESS_STC              = "Buttress"
IDC_OPTION_REBAR_RC_STAIR_STC                 = "Stair"
IDC_OPTION_REBAR_RC_CORBEL_BRAKET_STC         = "Corbel/Bracket"
IDC_OPTION_REBAR_RC_BEAM_TABLE_STC            = "Beam Table"
IDC_OPTION_REBAR_RC_SLAB_TABLE_STC            = "Slab Table"

// DgnRebarSRCPageDlg
IDC_REBAR_SRC_COLUMN_STC                      = "SRC Column"

// DgnSelectDlg
IDC_BTN_SELECT                                = "Select"
IDC_BTN_CLOSE                                 = "Close"

// DgnSetDefaultDlg
IDD_DGN_DEFAULT_DLG                           = "Set Default Data"
IDC_DEFAULT_FRAME_RC                          = "RC"
IDC_DEFAULT_FRAME_STL                         = "Steel"
IDC_DEFAULT_FRAME_SRC                         = "SRC"
IDC_DEFAULT_FRAME_ALU                         = "Aluminum"
IDC_DEFAULT_FRAME_RFM                         = "Reinforce"
IDC_DEFAULT_BTN_SET_DEFAULT                   = "Set Default"
IDC_DEFAULT_BTN_CLOSE                         = "Close"
IDC_DEFAULT_LABEL_GSLAB                       = "Slab"
IDC_DEFAULT_LABEL_GURBE                       = "Beam && Girder"
IDC_DEFAULT_LABEL_GURCO                       = "Column"
IDC_DEFAULT_LABEL_GURGC                       = "Column (Gen)"
IDC_DEFAULT_LABEL_GURSW                       = "Shear Wall"
IDC_DEFAULT_LABEL_GURDW                       = "Shear Wall (Combined)"
IDC_DEFAULT_LABEL_GUFDN                       = "Footing"
IDC_DEFAULT_LABEL_GURCF                       = "Footing (Combined)"
IDC_DEFAULT_LABEL_GURSF                       = "Footing (Strip)"
IDC_DEFAULT_LABEL_GURBW                       = "Basement Wall"
IDC_DEFAULT_LABEL_GURST                       = "Stair"
IDC_DEFAULT_LABEL_GURCB                       = "Corbel/Bracket"
IDC_DEFAULT_LABEL_GURBL                       = "Beam Table"
IDC_DEFAULT_LABEL_GURSL                       = "Slab Table"
IDC_DEFAULT_LABEL_GURBU                       = "Buttress"
IDC_DEFAULT_LABEL_GUSSG                       = "Beam && Column"
IDC_DEFAULT_LABEL_GUSBP                       = "Base Plate"
IDC_DEFAULT_LABEL_GUSBC                       = "Bolt Connection"
IDC_DEFAULT_LABEL_GUSCG                       = "Crane Girder"
IDC_DEFAULT_LABEL_GUSPG                       = "Purlin && Girth"
IDC_DEFAULT_LABEL_GUSWO                       = "Web Opening"
IDC_DEFAULT_LABEL_GUSST                       = "Steel Stair"
IDC_DEFAULT_LABEL_GUSWE                       = "Welding"
IDC_DEFAULT_LABEL_GUSEP                       = "Embedded Plate"
IDC_DEFAULT_LABEL_GUCCB                       = "Composite Beam"
IDC_DEFAULT_LABEL_GUCCO                       = "Column"
IDC_DEFAULT_LABEL_GUCFT                       = "CFT Column"
IDC_DEFAULT_LABEL_GUCBP                       = "Base Plate"
IDC_DEFAULT_LABEL_GUAMT                       = "Beam && Column (General)"
IDC_DEFAULT_LABEL_GUAAG                       = "Beam && Column"
IDC_DEFAULT_LABEL_NOTICE                      = "※ Select member to use as default data."
IDC_DEFAULT_LABEL_GURRW                       = "Retaining Wall"

//// IDD_DGN_PREF_GENERAL_DLG
IDC_DGN_PREF_GEN_FRAME_MODE                   = "User Interface Mode"
IDC_DGN_PREF_GEN_RADIO_MODE_SIMPLE            = "Simple Mode (Calculation Mode)"
IDC_DGN_PREF_GEN_RADIO_MODE_PROJECT           = "Project Mode (Calculation / Dwg / Report / Quantity / Gen,ADS Link  Mode)"
IDC_DGN_PREF_GEN_RADIO_MODE_CHECK             = "Check Mode (Check design result)"
IDC_DGN_PREF_GEN_FRAME_REPORT                 = "Default Report Type for Simple Mode"
IDC_DGN_PREF_GEN_RADIO_REPORT_DET             = "Detail"
IDC_DGN_PREF_GEN_RADIO_REPORT_SUM             = "Summary"
IDC_DGN_PREF_GEN_RADIO_REPORT_INP             = "Input List"
IDC_DGN_PREF_GEN_FRAME_CHECK                  = "Default Report Type for Check Mode"
IDC_DGN_PREF_GEN_CHECK_DEFAULT_TYPE           = "Default Report Type"
IDC_DGN_PREF_GEN_RADIO_CHK_REPORT_DET         = "Detail"
IDC_DGN_PREF_GEN_RADIO_CHK_REPORT_SUM         = "Summary"
IDC_DGN_PREF_GEN_CHECK_CONTENTS               = "Report Contents"
IDC_DGN_PREF_GEN_RADIO_CHK_CONTENT_SIMPLE     = "Simple Mode"
IDC_DGN_PREF_GEN_RADIO_CHK_CONTENT_PROJECT    = "Project Mode"
IDC_DGN_PREF_GEN_FRAME_COVER                  = "Cover Concrete Depth"
IDC_DGN_PREF_GEN_RADIO_CLEAR_COVER            = "Use Clear Cover"
IDC_DGN_PREF_GEN_RADIO_DISTANCE               = "Use Distance from Face to Rebar Center"
IDC_DGN_PREF_GEN_NOTICE                       = "※ Columns (RC, SRC) Use Distance from Face to Center Regardless of Option."
IDC_DGN_PREF_GEN_FRAME_RESULT                 = "Result data"
IDC_DGN_PREF_GEN_CHECK_KEEP_RESULT            = "Do not Delete Results Data When Input Data is Changed"
IDC_DGN_PREF_GEN_CHECK_INCLUDE_RESULT         = "Include Design Results in Input File (Excel)"
IDC_DGN_PREF_GEN_CHECK_SHOW_APPLY             = "Show Apply Button in Member Dialog"
IDC_DGN_PREF_BTN_DEFAULT_GEN                  = "Default"

////// IDD_DGN_PREF_SYSTEM_DLG
IDC_DGN_PREF_SYSTEM_CHK_AUTO_SAVE             = "Auto Save"
IDC_DGN_PREF_SYSTEM_STC1                      = "In Every"
IDC_DGN_PREF_SYSTEM_STC2                      = "Minutes"
IDC_DGN_PREF_SYSTEM_CHK_MAKE_BACKUP           = "Make Backup File (.bak)"
IDC_DGN_PREF_SYSTEM_ACTION_FRAME              = "Select Action in WorkBar"
IDC_DGN_PREF_SYSTEM_CHK_MOUSE_SINGLE          = "Select Member by Single-Click or Up/Down Arrow Keys"
IDC_DGN_PREF_SYSTEM_CHK_REPORT_VIEW           = "Change Report View with Checking Result of Selected Member"
IDC_DGN_PREF_SYSTEM_USER_IFORM_FRAME          = "User Informations"
IDC_DGN_PREF_SYSTEM_COMPANY_FULL              = "Company (Full) :"
IDC_DGN_PREF_SYSTEM_COMPANY_SHORT             = "Company (Short) :"
IDC_DGN_PREF_SYSTEM_ADDRESS                   = "Address :"
IDC_DGN_PREF_SYSTEM_WEBSITE                   = "Website (URL) :"
IDC_DGN_PREF_SYSTEM_TELL                      = "Tel. :"
IDC_DGN_PREF_SYSTEM_FAX                       = "FAX :"
IDC_DGN_PREF_SYSTEM_CHK_APPLY_USER_INFO       = "Apply this informations to reports"
IDC_DGN_PREF_BTN_DEFAULT_SYSTEM               = "Default"

////// IDD_DGN_PREF_WORD_DLG
IDC_DGN_PREF_BTN_DEFAULT_WORD                 = "Default"
IDC_DGN_PREF_FRAME_STYLE                      = "Style"

////// IDD_DGN_INIT_DLG
IDD_DGN_INIT_DLG                              = "Initial Data Setting ( Registry )"
IDC_DGN_INIT_TAB_COMM                         = "Common"
IDC_DGN_INIT_TAB_RPRT                         = "Report"
IDC_DGN_INIT_TAB_DATA                         = "Data Base"
IDC_DGN_INIT_TAB_CODE                         = "Design Code"
IDC_DGN_INIT_TAB_BDGN                         = "Batch Design"
IDC_DGN_INIT_BTN_DEFAULT_ALL                  = "Default (All)"
IDC_DGN_INIT_BTN_IMPORT                       = "Import..."
IDC_DGN_INIT_BTN_EXPORT                       = "Export..."
IDC_DGN_INIT_BTN_APPLY                        = "Apply"
IDC_DGN_INIT_BTN_CLOSE                        = "Cancel"

/////// IDD_DGN_INIT_COMM_DLG
IDC_DGN_INIT_COMM_FRM_UNIT                    = "Unit System"
IDC_DGN_INIT_COMM_RDO_UNIT_USER               = "User Defined"
IDC_DGN_INIT_COMM_RDO_UNIT_PRED               = "Pre-defined"
IDC_DGN_INIT_COMM_FRM_MODE                    = "Program Mode"
IDC_DGN_INIT_COMM_RDO_MODE_SIMP               = "Simple Mode"
IDC_DGN_INIT_COMM_RDO_MODE_PROJ               = "Project Mode"
IDC_DGN_INIT_COMM_RDO_MODE_CHCK               = "Check Mode"
IDC_DGN_INIT_DESC_MODE_SIMP                   = "Calculation Mode Only"
IDC_DGN_INIT_DESC_MODE_PROJ                   = "Calculation / Drawing / Report / Quantity / Gen,ADS Link Mode"
IDC_DGN_INIT_DESC_MODE_CHCK                   = "Check Design Result"
IDC_DGN_INIT_COMM_BTN_DEFAULT                 = "Default"

/////// IDD_DGN_INIT_DATA_DLG
IDC_DGN_INIT_DATA_FRM_STL                     = "Steel Data Base"
IDC_DGN_INIT_DATA_LBL_STL_MATL                = "Material"
IDC_DGN_INIT_DATA_LBL_STL_SECT                = "Section"
IDC_DGN_INIT_DATA_CHK_STL_SECT                = "Use User Defined Section List"
IDC_DGN_INIT_DATA_FRM_ALU                     = "Aluminum Data Base"
IDC_DGN_INIT_DATA_LBL_ALU_MATL                = "Material"
IDC_DGN_INIT_DATA_LBL_ALU_SECT                = "Section"
IDC_DGN_INIT_DATA_CHK_ALU_SECT                = "Use User Defined Section List"
IDC_DGN_INIT_DATA_FRM_RFM                     = "Reinforcement Data Base"
IDC_DGN_INIT_DATA_LBL_RFM_MATF                = "Material( FRP )"
IDC_DGN_INIT_DATA_LBL_RFM_MATS                = "Material( Steel )"
IDC_DGN_INIT_DATA_FRM_BAR                     = "Rebar Data Base"
IDC_DGN_INIT_DATA_LBL_BAR_RBAR                = "Rebar"
IDC_DGN_INIT_DATA_CHK_BAR_SPAC                = "Use User Defined Space List"
IDC_DGN_INIT_DATA_BTN_DEFAULT                 = "Default"

/////// IDD_DGN_INIT_CODE_DLG
IDC_DGN_INIT_CODE_FRM_CODE                    = "Design Code"
IDC_DGN_INIT_CODE_LBL_CODE_RCS                = "Concrete"
IDC_DGN_INIT_CODE_LBL_CODE_STL                = "Steel"
IDC_DGN_INIT_CODE_LBL_CODE_SRC                = "SRC"
IDC_DGN_INIT_CODE_LBL_CODE_ALU                = "Aluminum"
IDC_DGN_INIT_CODE_LBL_CODE_CFS                = "Cold Formed Section"
IDC_DGN_INIT_CODE_LBL_CODE_RFM                = "Reinforcement"
IDC_DGN_INIT_CODE_FRM_LOAD                    = "Design Load"
IDC_DGN_INIT_CODE_LBL_LOAD_LIVE               = "Uniform Live Load"
IDC_DGN_INIT_CODE_LBL_LOAD_WIND               = "Wind Load"
IDC_DGN_INIT_CODE_LBL_LOAD_SNOW               = "Snow Load"
IDC_DGN_INIT_CODE_BTN_DEFAULT                 = "Default"

/////// IDD_DGN_INIT_BDGN_DLG
FONT_SIZE_MEMBER_NAME                         = "Font size of Member Name"
SYMBOL_SIZE_END_RELEASE                       = "Symbol size of End Release"
FONT_SIZE_REBAR_INFO                          = "Font size of Rebar Information"
FONT_SIZE_DESIGN_RESULT                       = "Font size of Design Result"
FONT_SIZE_COLM_LOCATION_DWG                   = "Font size of Column Location Drawing"
LINE_WEIGHT_SELECTED_ITEM                     = "Line weight of Selected Item"

//IDD_DGN_RBAR_MATL_CHK_DLG
IDC_DGN_RBAR_MATL_CHK_DLG_STC1                = "Setting for Material by Rebar Diameter is different with that of Design+"
IDC_DGN_RBAR_MATL_CHK_DLG_STC2                = "Do you want to change current setting of Design+?"
IDC_DGN_RBAR_MATL_CHK_DLG_STC3                = "( RC > Batch Wall > Smart Design Option > Material by Rebar Dia )"
IDC_DGN_RBAR_MATL_CHK_DLG_STC4                = "Yes"
IDC_DGN_RBAR_MATL_CHK_DLG_STC6                = ": Apply linked program's setting."
IDC_DGN_RBAR_MATL_CHK_DLG_STC7                = ": Keep current setting."
IDC_DGN_RBAR_MATL_CHK_DLG_STC5                = "No"

//IDD_DGN_ALU_DEFL_DLG
IDC_DGN_DEFL_EDT_SPAN                         = "by Span"
IDC_DGN_DEFL_EDT_VALUE                        = "by Value"
IDC_DGN_DEFL_EDT_SPAN2                        = "by Span"
IDC_DGN_DEFL_EDT_ADDITIONAL                   = "Additional"
IDC_DGN_DEFL_EDT_SELF_GLASS                   = "Self ( Glass )"
IDC_DGN_DEFL_EDT_SPAN3                        = "by Span"
IDC_DGN_DEFL_EDT_VALUE3                       = "by Value"
IDC_DGN_DEFL_BTN_APPL                         = "&Apply"
IDC_DGN_DEFL_BTN_CNCL                         = "&Cancel"
IDC_DGN_DEFL_FRM_L_SMALL                      = "L ≤ 4.110m"
IDC_DGN_DEFL_FRM_L_LARGE                      = "L > 4.110m"

//IDD_DGN_ALU_OPTION_DLG
IDD_DGN_ALU_OPTION_DLG                        = "Aluminum Option"

//IDD_DGN_ALU_OPTION_GEN_DLG
IDC_DGN_ALU_OPT_SECTION_STC                   = "Section DB Folder (*.sec)"
IDC_DGN_ALU_OPT_CHK_UNIT                      = "Print SI unit value with code unit value."

//IDD_DGN_ANCH_BOLT_DLG
IDS_DGN_ANCH_BOLT_TOOLTIP_ABRG_STUD           = "Diameter for Net Bearing Area ( Abrg ) of Headed Stud"
IDS_DGN_ANCH_BOLT_TOOLTIP_ABRG_ANCH           = "Diameter for Net Bearing Area ( Abrg ) of Anchor Bolt"
IDS_DGN_ANCH_BOLT_TOOLTIP_ABRG_RBAR           = "Diameter for Net Bearing Area ( Abrg ) of Headed deformed bar"

//IDD_DGN_ANCHOR_DLG
IDD_DGN_ANCHOR_DLG                            = "Anchor Data"
IDC_DGN_ANCHOR_FRM_MEMB                       = "Select Member"
IDC_DGN_ANCHOR_BTN_ALL                        = "All"
IDC_DGN_ANCHOR_BTN_NON                        = "None"
IDC_DGN_ANCHOR_FRM_CONC                       = "Concrete"
IDC_DGN_ANCHOR_RDO_CRACK                      = "Cracked"
IDC_DGN_ANCHOR_RDO_UNCRA                      = "Uncracked"
IDC_DGN_ANCHOR_LBL_CONC_KCKC                  = "Concrete Breakout Strength Coefficient (kc)"
IDC_DGN_ANCHOR_FRM_ANCH                       = "Anchor"
IDC_DGN_ANCHOR_LBL_ANCH_NPNP                  = "Pullout Strength (Np)"
IDC_DGN_ANCHOR_LBL_ANCH_EHEH                  = "Dist. of J/L-Bolt (eh)"
IDC_DGN_ANCHOR_FRM_FACT                       = "Strength Reduction Factor"
IDC_DGN_ANCHOR_LBL_FACT_STLT                  = "Steel / Tension"
IDC_DGN_ANCHOR_LBL_FACT_STLV                  = "Steel / Shear"
IDC_DGN_ANCHOR_LBL_FACT_CONT                  = "Concrete / Tension"
IDC_DGN_ANCHOR_LBL_FACT_CONV                  = "Concrete / Shear"
IDC_DGN_ANCHOR_BTN_APPLY                      = "&Apply"
IDC_DGN_ANCHOR_BTN_CANCE                      = "&Cancel"
IDC_DGN_ANCHOR_BTN_DEFAULT                    = "&Default"

//IDD_DGN_LOAD_SNOW_DLG
IDD_DGN_LOAD_SNOW_DLG                         = "Snow Load"
IDC_DGN_SNOW_FRM_SNOW                         = "Snow Load"
IDC_DGN_SNOW_LBL_SNOW                         = "Basic Ground Snow Load"
IDC_DGN_CHK_HILLSIDE                          = "Hillside or Mountainous area"
IDC_DGN_SNOW_LBL_BASE                         = "Basic Roof Snow Load Factor"
IDC_DGN_SNOW_LBL_EXPO                         = "Exposure Category"
IDC_DGN_SNOW_LBL_TEMP                         = "Temperature Factor"
IDC_DGN_SNOW_LBL_IMPO                         = "Importance Category"
IDC_DGN_SNOW_LBL_ROOF                         = "Roof Type"
IDC_DGN_SNOW_LBL_ANGL                         = "Roof Angle"
IDC_DGN_CHK_CONSIDER_RAIN_LOAD                = "Consider Additional Load Due to Rain"
IDC_DGN_SNOW_BTN_APPLY                        = "&Apply"
IDC_DGN_SNOW_BTN_CANCE                        = "&Cancel"
IDC_DGN_SNOW_FRM_MEMB                         = "Select Member"
IDC_DGN_SNOW_BTN_ALL                          = "All"
IDC_DGN_SNOW_BTN_NON                          = "None"

//IDD_DGN_LOAD_SNOW_US_DLG
IDC_DGN_SNOW_LBL_ANGL_ROOF                    = "Roof Angle"
IDC_DGN_SNOW_LBL_ANGL_EAVE                    = "Eave Angle"
IDC_DGN_SNOW_LBL_HORI_DIST                    = "Horizontal Distance"


//IDD_DGN_STL_OPTION_SECT_DLG
IDC_DGN_STL_OPT_DGN_STATIC_BP                 = "Base Plate (Plate Type)"
IDC_DGN_STL_OPT_DGN_CHK_SOFT_BP               = "Soft Plate (FEM Analysis)"
IDC_DGN_STL_OPT_DGN_CHK_RIGD_BP               = "Rigid Plate"
IDC_DGN_STL_OPT_DGN_NOTICE_BP                 = "※ Soft Plate does not support Design"
IDC_DGN_STL_OPT_DGN_STATIC_EP                 = "Embedded Plate (Plate Type)"
IDC_DGN_STL_OPT_DGN_CHK_SOFT_EP               = "Soft Plate (FEM Analysis)"
IDC_DGN_STL_OPT_DGN_CHK_RIGD_EP               = "Rigid Plate"
IDC_DGN_STL_OPT_DGN_NOTICE_EP                 = "※ Soft Plate does not support Design"

//IDD_DGN_STL_OPTION_DLG
IDD_DGN_STL_OPTION_DLG                        = "Steel Option"
IDC_DGN_STL_OPT_BTN_DEF                       = "&Default"
IDC_DGN_STL_OPT_BTN_OK                        = "&OK"
IDC_DGN_STL_OPT_BTN_APPLY                     = "&Apply"
IDC_DGN_STL_OPT_BTN_CANCEL                    = "&Cancel"

//IDD_DGN_STL_OPTION_SECT_DLG
IDC_DGN_STL_OPT_SECT_STC_DB                   = "DB"
IDC_DGN_STL_OPT_SECT_STC_SHAPE                = "Shape"
IDC_DGN_STL_OPT_SECT_BTN_BEAM_ADD_DB          = ">>"
IDC_DGN_STL_OPT_SECT_BTN_BEAM_DEL_DB          = "<<"
IDC_DGN_STL_OPT_SECT_STC_BEAM                 = "Beam"
IDC_DGN_STL_OPT_SECT_BTN_BEAM_UP              = "Up"
IDC_DGN_STL_OPT_SECT_BTN_BEAM_DN              = "Down"
IDC_DGN_STL_OPT_SECT_BTN_COLUMN_ADD_DB        = ">>"
IDC_DGN_STL_OPT_SECT_BTN_COLUMN_DEL_DB        = "<<"
IDC_DGN_STL_OPT_SECT_STC_COLUMN               = "Column"
IDC_DGN_STL_OPT_SECT_BTN_COLUMN_UP            = "Up"
IDC_DGN_STL_OPT_SECT_BTN_COLUMN_DN            = "Down"
IDC_DGN_STL_OPT_SECT_STC_USER                 = "User"
IDC_DGN_STL_OPT_SECT_BTN_BEAM_ADD_USER        = ">> Beam"
IDC_DGN_STL_OPT_SECT_BTN_COLUMN_ADD_USER      = ">> Column"
IDC_DGN_STL_OPT_SECT_CHK_AUTO_GEN_NAME        = "Auto Generation User Section Name"
IDC_DGN_STL_OPT_SECT_CHK_USE_USER_LIST        = "Use User Defined Section List"

//IDD_DGN_ALU_OPTION_SECT_DLG
IDC_DGN_ALU_OPT_SECT_STC_DB                   = "DB"
IDC_DGN_ALU_OPT_SECT_STC_SHAPE                = "Shape"
IDC_DGN_ALU_OPT_SECT_BTN_BEAM_ADD_DB          = ">>"
IDC_DGN_ALU_OPT_SECT_BTN_BEAM_DEL_DB          = "<<"
IDC_DGN_ALU_OPT_SECT_STC_BEAM                 = "Beam"
IDC_DGN_ALU_OPT_SECT_BTN_BEAM_UP              = "Up"
IDC_DGN_ALU_OPT_SECT_BTN_BEAM_DN              = "Down"
IDC_DGN_ALU_OPT_SECT_BTN_COLUMN_ADD_DB        = ">>"
IDC_DGN_ALU_OPT_SECT_BTN_COLUMN_DEL_DB        = "<<"
IDC_DGN_ALU_OPT_SECT_STC_COLUMN               = "Column"
IDC_DGN_ALU_OPT_SECT_BTN_COLUMN_UP            = "Up"
IDC_DGN_ALU_OPT_SECT_BTN_COLUMN_DN            = "Down"
IDC_DGN_ALU_OPT_SECT_STC_USER                 = "User"
IDC_DGN_ALU_OPT_SECT_BTN_BEAM_ADD_USER        = ">> Beam"
IDC_DGN_ALU_OPT_SECT_BTN_COLUMN_ADD_USER      = ">> Column"
IDC_DGN_ALU_OPT_SECT_CHK_AUTO_GEN_NAME        = "Auto Generation User Section Name"
IDC_DGN_ALU_OPT_SECT_CHK_USE_USER_LIST        = "Use User Defined Section List"

//IDD_DGN_STIF_DLG
IDD_DGN_STIF_DLG                              = "Stiffener / Concentrated Force Data"
IDC_DGN_STIF_FRM_MEMB                         = "Select Member"
IDC_DGN_STIF_BTN_ALL                          = "All"
IDC_DGN_STIF_BTN_NON                          = "None"
IDC_DGN_STIF_FRM_SECT                         = "Stiffener"
IDC_DGN_STIF_LBL_SECT_B                       = "Width"
IDC_DGN_STIF_LBL_SECT_T                       = "Thickness"
IDC_DGN_STIF_LBL_SECT_S                       = "Space"
IDC_DGN_STIF_CHK_FLG_BR                       = "Braced Compression Flange"
IDC_DGN_STIF_FRM_FORC                         = "Concentrated Force"
IDC_DGN_STIF_LBL_FORC_V                       = "Force"
IDC_DGN_STIF_LBL_FORC_M                       = "Moment"
IDC_DGN_STIF_LBL_FORC_B                       = "Bearing Length"
IDC_DGN_STIF_LBL_FORC_D                       = "Distance from Support"
IDC_DGN_STIF_BTN_DEFAULT                      = "&Default"
IDC_DGN_STIF_BTN_APPLY                        = "&Apply"
IDC_DGN_STIF_BTN_CANCE                        = "&Cancel"

//IDD_DGN_STL_SECTION_DLG
IDC_DGN_CHK_DB                                = "Use DB"
IDC_DGN_LABEL_SHAPE                           = "Shape"

/////// IDD_DGN_RFM_MATL_DLG
IDC_DGN_RFM_MATL_CHK_USER                     = "User Defined Material"
IDC_DGN_RFM_MATL_LBL_MATL                     = "Material"
IDC_DGN_RFM_MATL_STRENGTH_RATIO               = "Strength Ratio"
IDC_DGN_RFM_MATL_STRAIN_RATIO                 = "Strain Ratio"

/////// IDD_DGN_RFM_MATL_INFO_DLG
IDD_DGN_RFM_MATL_INFO_DLG                     = "FRP / Carbon Material Information"
IDS_DGN_RFM_MATL_INFO_NAME                    = "Name"
IDS_DGN_RFM_MATL_INFO_THICK                   = "Thick"
IDS_DGN_RFM_MATL_INFO_YIELD                   = "Yield"
IDS_DGN_RFM_MATL_INFO_ELAST                   = "Elast"
IDS_DGN_RFM_MATL_INFO_STRAIN                  = "Strain"
IDS_DGN_RFM_MATL_INFO_FIBER_TYPE              = "Fiber\nType"

////// IDD_DGN_MEMBER_LIST_BTN_DLG
IDC_DGN_LIST_DLG_TXT_REM                      = "Ctrl+Up/Down to Copy"

//IDD_DGN_STL_SECTION_EX_DLG
IDD_DGN_STL_SECTION_EX_DLG                    = "Steel Section Property"
IDC_DGN_FRM_SECTION                           = "Section"
IDC_DGN_STATIC_PICTURE                        = "Drawing"
IDC_DGN_FRM_SECTIONPROPERTY                   = "Section Property"

/////// IDC_DGN_CRANE_COMBO_TYPE
IDC_DGN_CRANE_BTN_APPLY                       = "&Apply"
IDC_DGN_CRANE_BTN_CANCEL                      = "&Cancel"
IDC_DGN_CRANE_FRAME                           = "Crane Type"
IDS_STL_CRANE_TYPE_MONORAIL_MOTOR             = "Monorail Crane(Motor Operated)"
IDS_STL_CRANE_TYPE_REMOTE_CONTROL_BRIGE       = "Cab or remote operation crane (Motor Operated)"
IDS_STL_CRANE_TYPE_PENDENT_BRIGE              = "Pendant operation brdige crane (Motor Operated)"
IDS_STL_CRANE_TYPE_BRIGE_AND_MONORAIL         = "Bridge or monorail crane(Hand Brdige, trolley, hoist)"

/**/IDC_GUOPT_COMBO_LOAD_LIVE_TEXT            = "Uniform live load"

/////// IDD_DGN_OPT_LOAD_DLG
/**/IDD_DGN_OPT_LOAD_DLG                      = "Design load"
/**/IDD_DGN_OPT_LOAD_TEXT                     = "Code of uniform live load is changed."
/**/IDD_DGN_OPT_LOAD_TEXT2                    = "Live loads will be delete."
/**/IDD_DGN_OPT_LOAD_TEXT3                    = "Do you Wish to Continue"
/**/IDD_DGN_OPT_LOAD_YES                      = "Yes"
/**/IDD_DGN_OPT_LOAD_NO                       = "No"

/////// IDD_DGN_ZOOM_DLG
IDD_DGN_ZOOM_SECT_DLG                         = "Section Preview"
IDD_DGN_ZOOM_RSLT_DLG                         = "Result Preview"
IDD_DGN_ZOOM_PMCV_DLG                         = "PM Interaction Curve"
IDD_DGN_ZOOM_MMCV_DLG                         = "MM Interaction Curve"
IDC_DGN_ZOOM_CHK_MESH                         = "Mesh Line"
IDC_DGN_ZOOM_CHK_CONT                         = "Contour"
IDC_DGN_ZOOM_CHK_VALU                         = "Value"
IDC_DGN_ZOOM_LBL_CLOS                         = "Double Click to Close"

/////// IDD_DGN_DEFL_DLG
IDD_DGN_DEFL_DLG                              = "Deflection Condition"
IDC_DGN_DEFL_FRM_MEMB                         = "Select Member"
IDC_DGN_DEFL_BTN_ALL                          = "All"
IDC_DGN_DEFL_BTN_NONE                         = "None"
IDC_DGN_DEFL_RDO_LINE_LOAD                    = "Use Line Load"
IDC_DGN_DEFL_RDO_MOMENT                       = "Use Moment"
IDC_DGN_DEFL_BTN_OK                           = "Apply"
IDC_DGN_DEFL_BTN_CANCEL                       = "Cancel"
IDC_DGN_DEFL_FRM_DESIGN_LOAD                  = "Design Load"
IDC_DGN_DEFL_LBL_SUSTAINED_LOAD               = "Sustained Load"
IDC_DGN_DEFL_LBL_SPAN                         = "Span"
IDC_DGN_DEFL_FRM_SUPPORT_CONDITION            = "Support Condition"
IDC_DGN_DEFL_FRM_CONDITION_FACTORS            = "Factors"
IDC_DGN_DEFL_LBL_SHORT_TERM                   = "Short-term"
IDC_DGN_DEFL_STC_SHORT_TERM                   = "L /"
IDC_DGN_DEFL_LBL_LONG_TERM                    = "Long-term"
IDC_DGN_DEFL_STC_LONG_TERM                    = "L /"
IDC_DGN_DEFL_LBL_TIME_FACTOR                  = "Time-dependent Factor"
IDC_DGN_DEFL_STC_TIME_FACTOR                  = "( Months )"
IDC_DGN_DEFL_FRM_CONDITION_SPAN               = "Span"

/////// IDD_DGN_DEFL_LOAD_LINE_DLG
IDC_DGN_DEFL_LBL_DEAD_LOAD                    = "Dead Load"
IDC_DGN_DEFL_LBL_LIVE_LOAD                    = "Live Load"
IDC_DGN_DEFL_FRM_DGN_LOAD                     = "Design Load"

/////// IDD_DGN_DEFL_LOAD_MOME_DLG
IDC_DGN_DEFL_LBL_MDI                          = "M ( i )"
IDC_DGN_DEFL_LBL_MLI                          = "M ( i )"
IDC_DGN_DEFL_LBL_MDM                          = "M ( m )"
IDC_DGN_DEFL_LBL_MLM                          = "M ( m )"
IDC_DGN_DEFL_LBL_MDJ                          = "M ( j )"
IDC_DGN_DEFL_LBL_MLJ                          = "M ( j )"
IDC_DGN_DEFL_FRM_DEAD                         = "Dead Load"
IDC_DGN_DEFL_FRM_LIVE                         = "Live Load"

/////// IDD_DGN_REPORT_OPT_DATA_DLG
IDC_DGN_CHK_VISITEM                           = "Include Visual Items"
IDC_DGN_CHK_PRNITEM                           = "Include Visual Items in Printed"
IDC_DGN_CHK_RESTABLE                          = "Print Result Table"
IDC_DGN_CHK_BARCLUSTR                         = "Print Bar Cluster"
IDC_DGN_CHK_SIMHEAD                           = "Simplified Column Header"

/////// IDD_DGN_REPORT_OPT_PAGE_DLG
IDC_DGN_FRM_CALC_RSLT                         = "Calcuation Result Summary"
IDC_DGN_FRM_DETL_RPRT                         = "Detail Report"
IDC_DGN_FRM_SUMM_RPRT                         = "Summary Report"
IDC_DGN_FRM_RPRT_UNIT                         = "Unit System"
IDC_DGN_CHK_CODE_UNIT                         = "Report in Design Code Unit"
IDC_DGN_CHK_UNIT_USER                         = "User Unit System"

/////// IDD_DGN_REPORT_OPT_NUMB_DLG
IDS_DGN_REPORT_OPT_TAB_NUMB_FORM              = "Number Format"
IDS_DGN_BTN_SET_BY_UNIT_TYPE                  = "Set By Unit Type"
IDS_DGN_BTN_RESET_UNIT_TYPE                   = "Reset Unit Type"
IDC_DGN_BTN_EDIT_IN_TABLE_FORM                = "Edit in Table Form"

/////// IDD_DGN_REPORT_OPT_DLG
IDD_DGN_REPORT_OPT_DLG                        = "Report Option"
IDS_DGN_REPORT_OPT_TAB_GLBL_DATA              = "Global Data"
IDS_DGN_REPORT_OPT_TAB_MEMB_DATA              = "Member Data"
IDC_DGN_REPORT_OPT_BY_MEMBER                  = "Apply Option by Member"

/////// IDD_DGN_USER_STRN_FACT_DLG
IDS_DGN_GET_DEFAULT_STRN_FACT                 = "Get Default Strength Factor"
IDS_DGN_GET_DEFAULT_STRN_REDUCT_FACT          = "Get Default Strength Reduction Factor"
IDS_DGN_APPLY_USER_STRN_FACT                  = "Apply User Strength Factor"
IDS_DGN_APPLY_USER_STRN_REDUCT_FACT           = "Apply User Strength Reduction Factor"

/////// IDD_DGN_LAYR_DLG
IDS_DGN_CHANGE_COLOR_IN_DWG_PREVIEW_DLG       = "Change color by Drawing Preview Dialog"
IDS_DGN_LAYER_EXIST_EMPTY_NAME                = "Layer(s) without name is exist."
IDS_DGN_LAYER_EXIST_DUPLICATED                = "Duplicated layer name is exist."

/////// IDD_DGN_GROUP_DLG
IDS_DGN_GROUP_MANAGER                         = "Group Manager"
IDS_DGN_EDIT_GROUP                            = "Edit Group"
IDS_DGN_GROUP_IMPORT_FILE                     = "Import File ..."
IDS_DGN_GROUP_IMPORT_CLIPBOARD                = "Import Clipboard"
IDS_DGN_GROUP_IMPORT_FAIL                     = "Import of following group is Failed."
IDS_DGN_GROUP_IMPORT_GROUPING_FILE            = "Import Grouping File"
IDS_DGN_GROUP_IMPORT_NOT_UNICODE_FILE         = "Selected file is not Unicode.\nSave in Unicode and retry."
IDS_DGN_GROUP_NAME_OLD_EMPTY                  = "Existing group name is not selected.\nSelect group name by List control."
IDS_DGN_GROUP_NAME_NEW_EMPTY                  = "New group name is not entered."

/////// IDD_DGN_GROUP_CTRL_DLG
IDS_DGN_FROM_STORY_NAME_IS_EMPTY              = "FROM Story Name is empty."
IDS_DGN_TO_STORY_NAME_IS_EMPTY                = "TO Story Name is empty."
IDS_DGN_STORY_NAME_IS_SAME					  = "FROM Story Name and TO Story Name is same."
IDS_DGN_STORY_INC_IS_ZERO					  = "Story Increment is zero."
IDS_DGN_FROM_STORY_HIGHER_TO_STORY            = "FROM Story is higher than TO Story."

/////// IDD_DGN_NUMB_FORM_DLG
IDD_DGN_NUMB_FORM_DLG                         = "Number Format"
IDC_SET_CURRENT_UNIT_DATA                     = "Set Current Unit Data"

/////// IDD_DGN_PMCV_3D_DLG
IDD_DGN_PMCV_3D_DLG                           = "3D PM Curve"
IDS_DGN_PMCV_3D_NOT_EXIST_DATA                = "3D PM Curve Data is not exist."

IDC_RCS_MBAR_RHO_CMB                          = "Ratio of Main Rebar for Shear"
IDC_RCS_MBAR_RHO_LBL		                  = "Main Rebar Ratio"
